 [
    {
      "detail": "Aardvarks are small pig-like mammals that are found inhabiting a wide range of different habitats throughout Africa, south of the Sahara. They are mostly solitary and spend their days sleeping in underground burrows to protect them from the heat of the African sun, emerging in the cooler evening to search for food. Their name originates from the Afrikaans language in South Africa and means Earth Pig, due to their long snout and pig-like body. Aardvarks are unique among animals as they are the only surviving species in their animal family. Until recently it was widely believed that they were most closely related to other insectivores such as armadillos and pangolins but this is not the case with their closest living relatives actually thought to be elephants.\n\nThe diet of aardvarks is mainly comprised of ants and termites, with termites being their preferred food source. Despite this though, they are known to also eat other insects such as beetles and insect larvae. Aardvarks are built to be insectivores, with strong limbs and claws that are capable of breaking into the harder outer shell of termite mounds very efficiently. Once they have broken into the mound they then use their long, sticky tongue to harvest the insects inside and eat them whole without chewing as they are then ground down in their muscular stomachs. One of the aardvarks most distinctive features is the fact that they have columnar cheek-teeth that serve no functional purpose at all. With some larger ant species that need to be chewed they use the incisors that are located towards the back of their mouths. Aardvarks are also able to use the same techniques to break into underground ant nests.\n\nDespite the fact that aardvarks are nocturnal animals that live in the safety of underground burrows, they are threatened by a number of different predators throughout their natural environment. Lions, leopards, hyenas and large snakes (most notably pythons) are the main predators of aardvarks but this does vary depending on where the aardvark lives. Their main form of defence is to escape very quickly underground however, they are also known to be quite aggressive when threatened by these larger animals. Aardvarks use their strong, sharp claws to try and injure their attacker along with kicking the threatening animal with their powerful back legs. Aardvarks are also threatened by humans who hunt them and destroy their natural habitats.\n\nToday, aardvarks are listed by the IUCN as a species that is of Least Concern. Despite the fact that population numbers of aardvarks most certainly declined in some countries, in others, their numbers remain stable and they are often commonly found in both protected areas and regions with suitable habitats. They are however becoming increasingly affected by habitat loss in both the form of deforestation and expanding towns and villages. Due to their incredibly elusive nature, exact population sizes are not fully understood.",
      "family": "Orycteropodidae",
      "height": "43cm - 71cm (17in - 28in)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Faardvark_one?alt=media&token=7530e670-a70e-4a16-954b-ae4099b91c45",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Faardvark_two?alt=media&token=72891e92-691a-459b-8aa4-4812e7230a6a",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Faardvark_three?alt=media&token=f7c1b20f-96aa-41cd-b4d2-0450fec93262",
      "kingdom": "Animalia",
      "life_span": "23 years",
      "location": "Sub-Saharan Africa",
      "name": "Aardvark",
      "no_of_species": "18",
      "other_name": "Antbear, Earth Pig",
      "scientific_name": "Orycteropus afer",
      "weight": "1.4kg - 4.5kg (3lbs - 10lbs)"
    },
    {
      "detail": "The African Civet is a large species of Civet found across sub-Saharan Africa. The African Civet is the only remaining member in its genetic group and is considered to be the largest Civet-like animal on the African continent. Despite their cat-like appearance and behaviours, the African Civets are not felines at all but are in fact, more closely related to other small carnivores including Weasels and Mongooses. The African Civet is most well known for the musk that it secretes to mark its territory (called Civetone), which has been used in the manufacturing of perfumes for centuries, and its striking black and white markings, make the African Civet one of the easiest Civet species to identify.\n\nDespite the fact that the African Civet is a carnivorous mammal, it has a very varied diet that consists of both animal and plant matter. Small animals such as Rodents, Lizards, Snakes and Frogs make up the majority of the African Civet's diet, along with Insects, berries and fallen fruits that it finds on the forest floor. The African Civet predominantly uses its teeth and mouth to gather food instead of using its paws. This method of eating means that the African Civet can use its 40 sharp teeth effectively to break its catch down, and the strong jaw of the African Civet makes it harder for its meal to try and escape.\n\nDespite being a secretive yet a relatively ferocious predator, the African Civet is actually preyed upon by a number of other predators within their natural environment. Large predatory Cats are the most common predators of the African Civet including Lions and Leopards along with reptiles such as large Snakes and Crocodiles. African Civet populations are also under threat from both habitat loss and deforestation, and have been subject to trophy hunters in the past, across the continent. One of the biggest threats to the African Civet is the want for their musk.\n\nToday, the African Civet is under threat from deforestation and therefore drastic loss of much of its natural habitat. The main reason for such extensive deforestation in the area is either for logging or to clear the land to make way for palm oil plantations. The African Civet is listed as being Least Concern, which means that there is little threat at the moment that the African Civet will become extinct in the near future.",
      "family": "Viverridae",
      "height": "43cm - 71cm (17in - 28in)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fafricancivet_one?alt=media&token=7818d0ee-39f7-4080-a790-a1a0138e689e",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fafricancivet_two?alt=media&token=e37e3cec-cab0-4a7c-a753-69aa43699709",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fafricancivet_three?alt=media&token=b07dc8ab-d49d-45de-93dc-ca11fb687481",
      "kingdom": "Animalia",
      "life_span": "15 - 20 years",
      "location": "Location",
      "name": "African Civet",
      "no_of_species": "across sub-Saharan Africa",
      "other_name": "",
      "scientific_name": "Civettictis civetta",
      "weight": "1.4kg - 4.5kg (3lbs - 10lbs)"
    },
    {
      "detail": "The African Wild Dog (also known as the Painted Dog and the Cape Hunting Dog) is a medium sized species of canine found across sub-Saharan Africa. The African Wild Dog is most easily identified from both domestic and other wild Dogs by their brightly mottled fur, with its name in Latin aptly meaning painted wolf. The African Wild Dog is said to be the most sociable of all the canines, living in packs of around 30 individuals. Sadly however, this highly intelligent and sociable animal is severely under threat in much of its natural habitat, primarily due to habitat loss and having been hunted by Humans.\n\nThe African Wild Dog is a carnivorous and opportunistic predator, hunting larger animals on the African plains in their big groups. African Wild Dogs primarily prey on large mammals such as Warthogs and numerous species of Antelope, supplementing their diet with Rodents, Lizards, Birds and Insects. They are even known to hunt much larger herbivores that have been made vulnerable through sickness or injury, such as Wildebeest. Although the African Wild Dog's prey is often much faster, the chase can last for miles, and it is this Dog's stamina and perseverance that makes them so successful, along with their ability to maintain their speed. Hunting as a pack also means that the African Wild Dogs can easily corner their prey.\n\nDue to the relatively large size and dominant nature of the African Wild Dog and their pack, they have few natural predators within their native habitats. Lions and Hyenas have been known on occasion, to prey on African Wild Dog individuals that have been separated from the rest of the group. One of the biggest threats to the African Wild Dog are farmers that hunt and kill the African Wild Dog in fear that they are preying on their livestock. A drastic decline in their natural habitats has also pushed the remaining African Wild Dog populations into small pockets of their native regions, and they are now most commonly found within National Parks.\n\nToday, the African Wild Dog is listed as an Endangered species as African Wild Dog population numbers have been rapidly declining, particularly in recent years. There are thought to be less than 5,000 individuals left roaming sub-Saharan Africa today, with numbers still declining. Hunting, habitat loss and the fact that they are particularly vulnerable to the spread of disease by livestock, are the main causes for the continent's African Wild Dog loss.",
      "family": "Canidae",
      "height": "75cm - 110cm (29in - 43in)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fafrican_wild_dog_one?alt=media&token=9b820b45-6794-409d-980e-2ca03a5d23c9",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fafrican_wild_dog_two?alt=media&token=0b6e1707-3cea-4b6d-bf46-78f42108b7a7",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fafrican_wild_dog_three?alt=media&token=8d3ded0a-8da6-4a71-b11a-cc4c740b56f7",
      "kingdom": "Animalia",
      "life_span": "10 - 13 years",
      "location": "sub-Saharan Africa",
      "name": "African Wild Dog",
      "no_of_species": "1",
      "other_name": "Hunting Dog, Painted Dog, Painted Wolf",
      "scientific_name": "Lycaon pictus",
      "weight": "17kg - 36kg (39lbs - 79lbs)"
    },
    {
      "detail": "The Amur leopard is an isolated subspecies of leopards surviving along the border of Russia and China. While the Amur leopard may be the most rare big cat on Earth, its numbers have been rebounding thanks to incredible conservation efforts.\n\nThe Amur leopard is a carnivore that lives on a diet consisting predominately of sika deer, roe deer, and other small mammals such as squirrels, rodents, and hares. A solitary hunter, the Amur leopard ambushes its prey with bursts of energy that include tremendous leaping ability and speeds of up to 35 miles per hour (56 km/h).\n\nLike other leopard subspecies, the Amur leopard can climb trees for resting and also protecting its kills from other predators and scavengers. Due to the extreme environments Amur leopards live in, winter proves more difficult when less prey is available and snow makes it difficult for leopards to blend in with their background. During this time, Amur leopards will expand their home range in search of more available prey.\n\nThe Amur leopard faces few threats from predators, aside from humans who have hunted Amur leopards for their coats. While the Amur leopard is a top predator in their habitat, their range does overlap with the Siberian tiger.\n\nIn many regions where tiger and leopard territories overlap, leopards have struggled with the competition of another apex predator. However, researchers watching the growth of Siberian tiger populations haven’t detected an adverse effect on Amur leopards.",
      "family": "Felidae",
      "height": "90 cm - 180 cm (3ft - 6ft) excluding tail",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Famur_leopard_one?alt=media&token=68d71f92-4216-4fcb-958a-cd79809d2de7",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Famur_leopard_two?alt=media&token=8eff3f79-58cc-4d53-8f40-d8d9ec7a8426",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Famur_leopard_three?alt=media&token=7be08668-558d-4426-80e2-88022f6f0542",
      "kingdom": "Animalia",
      "life_span": "10 - 15 years in wild; up to 20 in captivity",
      "location": "Russia's Far East",
      "name": "Amur Leopard",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Panthera pardus orientalis",
      "weight": "25kg - 48kg (55lbs - 106lbs)"
    },
    {
      "detail": "Arctic wolves live in Greenland, Alaska, Iceland and Canada. But, these wolves live in caves and not dens like other types of wolves. Their short noses and small ears help to maintain their body heat on the tundra. The territory traveled by an Arctic wolf can add up to hundreds of miles.\n\nWhat do Arctic wolves eat? Arctic wolves eat Arctic hares, caribou, lemmings and muskoxen. An Arctic wolf is smaller than its close relative, the gray wolf. So, you may be wondering how a single Arctic wolf could hunt and kill large mammals. The answer is: They don’t hunt alone. A pack of wolves will work together to single out a weak member of a herd of caribou or muskoxen to capture. A large mammal will be eaten by a pack of wolves over the course of a week or so. An Arctic wolf is able to eat about 20 pounds of animal meat in one feeding period. Think of 20 pounds of meat as weighing the same as two big gallon cans of paint.\n\nPolar bears are the only animal predators of Arctic wolves. If a young wolf cub wanders out of the cave, it can be killed by a bear or another wolf. When humans venture out to where the Arctic wolves live, they pose a threat to them as well.\n\nAn Arctic wolf can survive for 4 or 5 months without eating. It can survive on fat stored in its body. But, it must eventually have nourishment in order to survive this harsh climate. If a wolf is in a weakened condition due to hunger, it may be attacked by other wolves.",
      "family": "Canidae",
      "height": "60cm - 91cm (24in - 36in)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Farctic_wolf_one?alt=media&token=1fbca3e3-2bb7-4365-9656-e8732fdfb9ce",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Farctic_wolf_two?alt=media&token=b4300831-421f-466a-9157-305360a74358",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Farctic_wolf_three?alt=media&token=901bb159-336d-4e4a-8698-77daa16f6250",
      "kingdom": "Animalia",
      "life_span": "7 - 10 years",
      "location": "",
      "name": "Arctic Wolf",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Canus Lupus Arcticus",
      "weight": "25kg - 40kg (55lbs - 88lbs)"
    },
    {
      "detail": "The Asian giant hornet has reached fame thanks to its nickname online, the murder hornet. While the species stings can be quite painful, its estimated the hornets kill less than 40 people a year in countries across Asia.(For perspective, 89 people in the U.S. died from native hornets, wasps and bees.)The hornets are native to the Asian seaboard, stretching from Russia's Far East to the tropics. However, in 2019 and 2020 sightings of these murder hornets began appearing in the Pacific Northwest, raising fears they could decimate local bee populations due to their signature decapitation of large honey bee populations with their large mandibles. The hornets then and carry the thorax from their victims to feed their young.Because a single murder hornet can kill up to 40 honey bees a minute, it only takes a few hornets to completely decimate an entire colony of honey bees in short order.\n\nThe Asian giant hornet is a dominant predator within its environment, mainly hunting other insects, particularly bees. Asian giant hornets are also commonly known to kill larger Insects such as preying mantises and even other wasps and hornets. Adult Asian giant hornets are unable to digest solid proteins and instead only eat the fluids from their victims. They are also known to feed their catch to their larvae (particularly the honey bee larvae) in the form of a regurgitated paste. The larvae then secrete a clear liquid which the adults consume, and is thought to give them a bit of an energy boost. Asian giant hornets predominantly use their mandibles rather than their powerful stingers in order to secure their prey.\n\nDue to the fact that the Asian giant hornet is an apex predator within its environment, it has no real natural predators within its native habitats. Humans pose the biggest threat to the world's largest wasp, mainly as they are consumed as part of normal diets in the areas where they are found. This is particularly common in the mountains of Japan where the Asian giant hornet populations are in the highest abundance. Despite its size and bad temper, numbers of the Asian giant hornet are declining in certain areas. This is mainly due to habitat loss in the form of deforestation. Honey bees in Eastern Asia are also starting to develop their own defense again the hornets, trapping them in their nest until it becomes too hot for this giant wasp and it dies.\n\nThe Asian giant hornet is today listed as a species that is Threatened from extinction in the near future, should the circumstances surrounding its survival not change. Despite their dominance in their natural environments, the Asian giant hornet populations are being severely affected by habitat loss is certain areas, predominantly in the form of deforestation.",
      "family": "Vespidae",
      "height": "2.7cm - 5.5cm (1.1in - 2.2in)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fhornet_one?alt=media&token=c28cc9f0-3b8c-44d3-85c4-e7cd9c6dea85",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fhornet_two?alt=media&token=fbeedcc7-de85-4ac0-817b-831fc35a7230",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fhornet_three?alt=media&token=ca8acc14-094d-46db-b5d1-95ff86dc4ace",
      "kingdom": "Animalia",
      "life_span": "3 - 5 months",
      "location": "Eastern Asia",
      "name": "Asian Giant Hornet",
      "no_of_species": "1",
      "other_name": "Giant Sparrow Bee",
      "scientific_name": "Vespa mandarinia",
      "weight": ""
    },
    {
      "detail": "This species used to be one of the most widespread grazing animals on the planet thousands of years ago. But population pressure from humans and domesticated cattle gradually reduced their numbers to a small range. The last known aurochs went extinct in 1627 in central Poland. However, the aurochs has held such a powerful grip on the human imagination that there have been numerous attempts to revive the extinct species from the dead.\n\nThe aurochs obtained all of their nutrients from grazing huge expanses of land. The most common foods they ate were grasses, twigs, and even acorns. Aurochs had a four-chambered stomach that contained various bacteria to help them break down and digest the tough cellulose of plant matter. Each compartment had its own specialized task. Food may spend dozens of hours in the animal’s stomach, during which it is regurgitated, chewed over, and swallowed again multiple times. Nearly all even-toed ungulates can claim to have a multi-chambered stomach.\n\nOnly the most ferocious predators, such as wolves and prehistoric large cats, dared to take on the adult aurochs. Their massive size offered them a huge degree of protection against predators. However, young calves were vulnerable to being picked off if they wandered too far from the herd. Sick adults left behind by the herd also made an easy target for hungry predators.",
      "family": "Bovidae",
      "height": "1.2m – 1.8m (4ft – 6ft)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Faurochs_one?alt=media&token=d8e7b51c-09be-4744-a9d0-c683ea7b5e06",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Faurochs_two?alt=media&token=808c5270-332e-4f87-bab9-1745926d4e02",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Faurochs_three?alt=media&token=014fdfdc-3b44-48c5-84c7-247db2ae4221",

      "kingdom": "Animalia",
      "life_span": "Perhaps 20 years on average",
      "location": "Europe, Asia, and North Africa",
      "name": "Aurochs",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Bos primigenius",
      "weight": "Up to 1,360kg (3,000lbs)"
    },
    {
      "detail": "Anteater refers to several medium-sized insect-eating mammals found in the Southern Hemisphere. They are edentate animals, meaning they have no teeth. However, they use their long tongues to eat the insects that comprise the bulk of their diet. Giant anteaters, the most well-known of the four species, can consume as much as 35,000 ants or termites in a single day. Most zoologists will tell you, Don't mess with an anteater because it really, really doesn't want to be friends\n\nAll types of anteaters use their sharp claws to tear into anthills and insect nests. They eat quickly, flicking their long tongues up to 150 times per minute. Most giant anteaters and tamanduas feed on anthills or termite mounds in less than 40 seconds. These quick meals have a two-fold purpose. For one, they leave some of the insects in their nests to repopulate so that they have a continual source of food. Secondly, they avoid painful stings from ants when the insects begin to realize the danger to their nests. Silky anteaters consume insects found in the tops of trees. Southern tamanduas avoid eating army ants and leaf-eating ants as these species have strong chemical defenses. They also eat honey and bees.\n\nThe International Union for Conservation of Nature (IUCN) Red List officially classifies giant anteaters as vulnerable, as they are the most threatened mammals in Central America and are extinct in Guatemala, El Salvador and Uruguay. The loss of their grassland habitats is a major threat as sugar cane growers regularly burn their fields, ultimately affecting anteater habitats. Some humans hunt them for food, while others kill them simply because they consider anteaters to be pests. In the Brazilian Cerrado Biome, many are killed by road traffic. Cougars and jaguars are their natural predators.",
      "family": "Myrmecophagidae",
      "height": "0.9m - 2.1m (3ft - 7ft)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fanteater_one?alt=media&token=b86d96cb-53ba-45e5-b6f7-586190a21145",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fanteater_two?alt=media&token=63a3184a-b3c0-428f-880d-f0470d87716e",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fanteater_three?alt=media&token=00c1c332-c6d3-4b4c-894a-bc3b3d4696c8",

      "kingdom": "Animalia",
      "life_span": "9 - 20 years",
      "location": "",
      "name": "Anteater",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Myrmecophaga Tridactyla",
      "weight": "18kg - 40kg (40lbs - 88lbs)"
    },
    {
      "detail": "Artic foxes are small, adorable, and have natural adaptations protecting them from predators and frigid temperatures. According to fossils, Artic foxes got their start in Tibet during the Pliocene Epoch, 2.6 million years ago, then spread to North America and Eurasia by migrating over ice-land bridges. The species is Iceland’s only native mammal, and while hundreds of thousands currently roam around the Arctic Circle, climate change threatens to decimate populations in the coming years.\n\nTheir meals of choice are lemmings, voles, hares, and other small rodents. When their preferred meat is unavailable, Artic foxes chow down on fish, snow geese eggs, ptarmigan, grouse, puffins, ringed seal pups, and reindeer. When things are truly scarce, they turn to berries and seaweed.\n\nDuring the summer and autumn, aided by their sharp smell and sight senses, they hunt prey. They can sniff out seal lairs from over a mile away and hear lemmings burrowing several inches below ground. On a good day, a family of foxes can down dozens of rodents. When lucky enough to have a surplus of food, the foxes bury it for a rainy day.\n\nThe species' main predators are polar bears, wolves, wolverines, brown bears, red foxes, and humans. They also must keep an eye out for fast golden eagles, bald eagles, and snowy owls that swoop down and snatch baby foxes.But these days, natural predators aren't their worst threat — climate change and offshore drilling are fast becoming the species' main nemesis. Arctic temperatures are skyrocketing — which leads to reduced sea ice and rising sea levels. Add some destructive oil extraction off the coast, and it's an ecological tinderbox on the brink of explosion.Plus, even though the foxes are still plentiful in most regions, other animals are dying off and creating food shortages. Moreover, due to rapidly melting ice, their lighter coats are becoming a liability, not an advantage. To complete the perfect storm, increasingly, these foxes are losing ground to the larger red fox.",
      "family": "Canidae",
      "height": "70cm - 110cm (28in - 43in)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Farctic_fox_one?alt=media&token=440f7abe-b480-4722-97ae-f80fe3800451",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Farctic_fox_two?alt=media&token=c1326bbe-6315-4896-be16-337309994d31",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Farctic_fox_three?alt=media&token=684813c4-5b73-46b5-9bb4-42f9524b40a2",

      "kingdom": "Animalia",
      "life_span": "7 - 10 years",
      "location": "",
      "name": "Artic Fox",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Vulpes lagopus",
      "weight": "1.4kg - 9.4kg (3lbs - 21lbs)"
    },
    {
      "detail": "Resembling an armor-plated vehicle, the armadillo is outfitted with formidable protection against its natural adversaries and predators, which are unable to pierce the tough hide. This natural defense has enabled this creature to thrive for millions of years across the Western Hemisphere. Very few mammals can match its sheer resilience and survivability.\n\nThe armadillo's most prominent feature, the scaly looking shell, provides an armor-like protection against predators. The armor covers most of head and body and sometimes the legs as well. Despite popular misconception, only one species, the three-banded armadillo, can roll into a ball. The other species dig deep into the ground with their sharp claws to protect their softer parts from damage when threatened by a predator. The number of armored bands on the shell varies by species. In fact, many species are named after the number of bands.\n\nArmadillos have adapted to rely on a nearly inexhaustible food source, spending most of the day foraging for invertebrates and larvae. Ants and termites appear to be a favorite meal for many species of armadillo, but they will also eat beetles, cockroaches, wasps, spiders, snails, scorpions, and much more. Other sources of food include fruits, vegetation, eggs, small reptiles and amphibians, and carrion.\n\nArmadillos face danger from all kinds of predators, including jaguars, coyotes, bobcats, wolves, bears, and large hawks and other birds of prey. The armored shell is obviously its main means of defense. If this fails, then it may try to lash out with its sharp claws, attempt to play dead, or simply run away. Although it may not look like it, the armadillo is actually an agile runner and jumper, capable of making a quick escape. One species of armadillo, the nine-banded, can actually float across water by taking in enough air to make its entire body buoyant.",
      "family": "Dasypodidae",
      "height": "36cm - 75cm (14in - 30in)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Farmadillo_one?alt=media&token=ef35cac7-2b16-4098-942c-b66f776cf84f",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Farmadillo_two?alt=media&token=b4251e6b-2531-4aed-bb18-fdaf8281c931",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Farmadillo_three?alt=media&token=09dcd826-7bf2-4044-9d46-395efeddc0a2",
      "kingdom": "Animalia",
      "life_span": "4 - 12 years",
      "location": "United States",
      "name": "Armadillo",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Dasypodidae",
      "weight": "4kg - 30kg (9lbs - 66lbs)"
    },
    {
      "detail": "Alligators are in the same family as other large reptiles like Crocodiles but are native to only two countries, which are the southern USA and China (where the Alligator is now nearly extinct). Alligators tend to be smaller than their Crocodile cousins but have been known to move at speeds of up to 15mph on land making them one of the fastest large reptiles in the world. Despite their size, there are a number of distinct differences between Alligators and Crocodiles as an Alligator's snout is shorter than that of a Crocodile, and with their mouths shut, an Alligator's teeth cannot be seen but a Crocodile's can. Alligators are also commonly known as Gators in their native, southern North American habitats.\n\nThe Alligator is generally a solitary predator, but smaller and younger Alligator individuals however, are known to stay together in groups especially when hunting. The Alligator eats fish, small mammals and birds, but the Alligator has also been known to attack much larger animals. Adult alligators have been known to hunt Deer and are well known to kill and eat smaller Alligators. In some cases, larger alligators have been known to hunt the Florida Panther and Black Bears, making the alligator the dominant predator throughout the their environment. Attacks on pets and even people are also not unknown. he Alligator is an apex predator in its environment, known to even hunt animals that are much larger in size. Humans are the only predator of adult Alligators as they were hunted almost to extinction for their meat, and for their unique skin which was used in the manufacture of a variety of products. The smaller, baby Alligators however, are prey to a number of species including Raccoons, Birds, Bobcats and even other Alligators. Despite being protected from hunting in much of its North American range today, Alligators are threatened by loss of their natural habitats and high levels of pollution in the water.\n\nAlligator DNA is thought to date back to even before Dinosaur times meaning that the Alligators survived whatever it was that the dinosaurs didn't, with the scientific estimates first dating the species 150 million years ago. The Chinese Alligator is currently found only in the Yangtze River Valley and the Chinese Alligator is now extremely endangered with less than 100 Chinese Alligators believed to be left in the wild. There are actually many more Chinese Alligators that live in zoos around the world than can be found in the wild today. Alligators are known to have up to 80 teeth which are perfectly shaped for biting down on prey. They are even able to regrow those teeth that are lost.\n\nUnlike large Crocodiles, Alligators do not immediately regard a Human upon encounter as prey, but the Alligator may still attack in self-defence if provoked. Alligator attacks are uncommon but Alligators have definitely been known to attack Humans if the Human is in the Alligator's territory and particularly if the animal feels threatened. They are however known to commonly prey on domestic animals including pets and sometimes livestock when they are close to Human settlements. Hunting towards the end of the last century almost completely obliterated the entire American Alligator population (and has pretty much done so to the Chinese Alligator). Fortunately the gravity of the situation in the USA was realised before it was too late, with the protection of the species having led to an increase in population numbers now.",
      "family": "Alligatoridae",
      "height": "2.5cm - 4.5m (8ft - 15ft)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Falligator_one?alt=media&token=000c0b00-d034-4981-8245-25c867703b07",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Falligator_two?alt=media&token=285feb34-8220-4422-831e-72b6ab725ca4",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Falligator_three?alt=media&token=33730ee1-2431-41c6-b099-7417325b09e3",
      "kingdom": "Animalia",
      "life_span": "30 - 60 years",
      "location": "southern USA and China",
      "name": "Alligator",
      "no_of_species": "2",
      "other_name": "Gator",
      "scientific_name": "Alligator mississippiensis",
      "weight": "181kg - 363kg (400lbs - 800lbs)"
    },
    {
      "detail": "Asian Elephants are much smaller than the African elephants only growing to a couple of meters tall. Asian elephants are found in the tropical jungles of India and China, and throughout most countries in south-east Asia.Asian elephants have been domesticated for hundreds of years for foresting and often battle. There are many places across Asia where Asian elephants are kept for tourists to ride, and are often treated fairly badly. Asian elephants are well known for their immense strength and friendliness towards humans.\n\nToday, the Asian elephant is considered an endangered species with only around 50,000 left in the wild. This is due to the loss of habitat of the Asian elephant and illegal poachers hunting the Asian elephant, for their skins and ivory.\n\nThe Asian elephant has smaller ears than the African elephant and the Asian elephant also has a more curved spine than the African elephant. Unlike the African elephants, the female Asian elephant very rarely have tusks, and if the female Asian elephant does have tusks, they are generally barely visible and can only be seen when the female Asian elephant opens her mouth.The Asian elephant follows strict migration routes that are determined by the monsoon season. The eldest elephant of the Asian elephant herd is responsible for remembering the migration route of its Asian elephant herd. This Asian elephant migration generally takes place between the wet and dry seasons and problems arose when farms where built along the migratory routes of the Asian elephant herds, as the Asian elephants caused a great deal of destruction to the newly founded farmland.\n\nAsian elephants are herbivorous animals meaning that they only eat plants and plant matter in order to gain all of the nutrients that they need to survive. Asian elephants eat a wide variety of vegetation including grasses, leaves, shoots, barks, fruits, nuts and seeds. Asian elephants often use their long trunk to assist them in gathering food.\n\nToday, the Asian elephant is considered to be an animal that is in immediate danger of becoming extinct due to the fact that Asian elephant populations have been declining at a critical rate. Asian elephants are thought to be suffering primarily due to habitat loss in the form of deforestation and hunting for their ivory tusks by human poachers.",
      "family": "Elephantidae",
      "height": "2m - 3m (7ft - 10ft)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fasian_elephant_one?alt=media&token=5c9570f1-1db3-47ac-9e07-c4a3cf9b8d6d",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fasian_elephant_two?alt=media&token=62c1e519-ce9c-4dbb-ac3c-b33ec01c5529",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fasian_elephant_three?alt=media&token=cebe57d9-a389-4f5d-a61c-eec82e02e892",
      "kingdom": "Animalia",
      "life_span": "55 - 70 years",
      "location": "",
      "name": "Asian Elephant",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Elephas Maximus",
      "weight": "3,000kg - 5,000kg (6,500lbs - 11,000lbs)"
    },
    {
      "detail": "The Asiatic Black Bear is a medium to large sized species of bear that is found inhabiting the deciduous tropical forest throughout Asia. Known to be closely related to the American Black Bear, the two species exhibit a number of similarities including their size, appearance and behaviour and are thought to have actually shared a common ancestor some 4 million years ago. Unlike the American Black Bear however, that is showing increases in population numbers particularly in certain areas, the Asiatic Black Bear is considered to be an endangered species throughout its native range today as populations have declined drastically due to both loss of their natural habitats to deforestation and the fact they are the most prized of all bear species that are hunted for their body parts (mainly the gall bladder) that are used in traditional medicines and also as a culinary delicacy in some areas.\n\nDespite being classed as carnivores, like other bear species Asiatic Black Bears have a widely varied omnivorous diet meaning that they eat both small animals and plants throughout their natural range. Due to the fact that the fruits, plants and seeds that they consume do not contain as much nutrition as larger animals would, Asiatic Black Bears spend vast portions of their waking hours foraging in the trees for food. Acorns, beechnuts, walnuts and other nuts and seeds, along with fruits such as cherries, bamboo shoots and leaves, grasses, herbs, grubs and insects including termites and ants make up the majority of their diet, supplemented by the occasional bird or rodent when other foods are in short supply. Due to the fact that Asiatic Black Bears eat such little meat, their large molar teeth are flat for grinding up vegetation more easily. In areas where human settlements have encroached heavily on the Asiatic Black Bear's natural habitats, they are sometimes known to raid agricultural plantations along with taking occasional livestock from farms.\n\nThe large size and ferocious nature of the Asiatic Black Bear has ensured that they have very few (if any) natural predators throughout their historically vast natural range. Tigers are the main predators of Asiatic Black Bears throughout Asia with the small cubs being particularly vulnerable to predation despite the fierce-some protection provided by the mother. Asiatic Black Bears are also more vulnerable in areas where their natural range overlaps those of other bears including Brown Bears in Russia and they are also threatened by packs of Wolves in some parts of their natural range. People however, have been and still remain, the biggest threat to the world's Asiatic Black Bear population as they are severely affected by the loss of their natural habitats to deforestation to either clear land for agriculture or increase the size of growing human settlements. They are also severely threatened by the hunting of them for their body parts that are highly prized in traditional medicines and despite the ban of their hunting in all countries with the exception of Japan, the trade still continues throughout their natural range today.\n\nFor 3,000 years people have hunted Asiatic Black Bears mainly for their paws and gall bladders as dried bile is used in traditional Chinese medicines and believed to contain numerous healing properties. This has led to them being captured and kept in bile farms particularity in China and Vietnam where their living conditions are often a great cause for concern for environmental activists and conservationists. This industry alone has contributed heavily to the severe decline in population numbers and coupled more recently with habitat loss could see Asiatic Black Bears disappearing completely from certain areas. Although cases are rare, they have been known to cause human fatalities in areas where settlements encroach heavily on their dwindling natural habitats and so many are often hunted as pests or threats, despite the killing of them being illegal. Asiatic Black Bears are often captured and kept as pets and captured in Pakistan to fight dogs, in a process known as bear baiting. Not only is this sport morally horrendously wrong but the teeth and claws of the Asiatic Black Bears are also removed before the fighting begins so they have no chance to defend themselves against the onslaught of the Bull Terriers.",
      "family": "Ursidae",
      "height": "1.2m - 1.9m (4ft - 6.25ft)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fasiatic_black_bear_one?alt=media&token=2fb99eaf-846b-4e1c-9700-3cd79a484aa9",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fasiatic_black_bear_two?alt=media&token=cb96baf2-79c1-4e5b-92d6-b8615369d4e6",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fasiatic_black_bear_three?alt=media&token=090ba956-0af2-44c3-a1b0-915d44ed8068",
      "kingdom": "Animalia",
      "life_span": "15 - 25 years",
      "location": "Central and Southern Asia, Russia and Japan",
      "name": "Asiatic Black Bear",
      "no_of_species": "7",
      "other_name": "Asian Black Bear, Himalayan Black Bear, Tibetan Black Bear, Moon Bear",
      "scientific_name": "Ursus tibetanus",
      "weight": "90kg - 115kg (198lbs - 253lbs)"
    },
    {
      "detail": "The Aye Aye is a species of Lemur that is found inhabiting the rainforests of Madagascar. The Aye Aye is not only the largest nocturnal primate in the world but is also one of the most unique and is in fact so strange in appearance, that it was thought to be a large species of Squirrel when it was first discovered. In the mid 1800s the Aye Aye was finally recognised as being a species of Lemur but was classified in a group of its own as their closest Lemur relatives remain a mystery even today. However, these incredibly unique animals are severely threatened throughout much of their natural habitat and were thought to be on the brink of extinction by 1980, primarily due to them being killed instantly by local people who believe that seeing an Aye Aye is very bad luck. Although today population numbers seem to have risen, the Aye Aye is one of Madagascar's most endangered animal species.\n\nThe Aye Aye is an omnivorous animal that feeds on both other animals and plant matter, moving about high up in the trees and under the cover of night. Males are known to cover distances of up to 4km a night in their search for food, feeding on a variety of fruits, seeds, insects and nectar. They are however specially adapted to hunt in a very unique way as they use their elongated middle finger to tap dead wood in search of the hollow tunnels created by wood-boring grubs, listening for even the slightest sound with their sensitive bat-like ears. Once the Aye Aye has detected its prey it uses its sharp front teeth to gnaw a hole into the wood before inserting the long middle finger, hooking the grub with its claw and extracting it (filling the same ecological niche as a Woodpecker). The Aye Aye is also known to use this long digit to eat eggs and coconut flesh and is thought to be the only primate to use echolocation when searching for food.\n\nThe secretive and tree-dwelling lifestyle of the Aye Aye means that it actually has very few natural predators in its native environment, with the agile and equally nocturnal Fossa being their most ferocious natural predator (along with Birds of Prey and Snakes that hunt the smaller and more vulnerable young). Humans are in fact the biggest threat to the Aye Aye as populations have been obliterated in much of their native forests due to superstition from local people who believe that it is a bad omen to see one. In other areas where they are not feared in this way, the Aye Aye is hunted as bushmeat. The biggest threat however to current populations is habitat loss caused both by deforestation and growing Human settlements that encroach on the Aye Aye's natural habitat.",
      "family": "Daubentoniidae",
      "height": "30cm - 40cm (12in - 15in)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Faye_aye_one?alt=media&token=abca0c19-9365-48ee-8a50-e66902183df8",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Faye_aye_two?alt=media&token=4aa3acf3-9066-43be-b908-1f98aa0b7e99",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Faye_aye_three?alt=media&token=e4201245-c062-4973-ac7f-a558cfb2253f",

      "kingdom": "Animalia",
      "life_span": "10 - 23 years",
      "location": "Eastern coast of Madagascar",
      "name": "Aye Aye",
      "no_of_species": "1",
      "other_name": "",
      "scientific_name": "Daubentonia madagascariensis",
      "weight": "2kg - 2.7kg (4lbs - 6lbs)"
    },
    {
      "detail": "The Baboon is a medium to large sized species of Old World Monkey that is found in a variety of different habitats throughout Africa and in parts of Arabia. There are five different species of Baboon which are the Olive Baboon, the Guinea Baboon, the Chacma Baboon, the Yellow Baboon and the Hamadryas Baboon which differs most from the others wide its bright red face and cliff-dwelling lifestyle (the other four species are collectively known as Savanna Baboons). However, there is some debate over the classification of the different species due to the fact that some have been known to interbreed, indicating that they could be sub-species instead. Baboons are incredibly sociable and intelligent animals that are known to form close bonds with other members of the troop that often last for life. They are also incredibly adaptable animals but their population numbers are declining throughout their natural range primarily due to hunting and habitat loss.\n\nThe Baboon is an omnivorous animal that is known to eat a wide variety of both plant matter and small animals. Fruits, seeds, tough roots and flowers all make up the bulk of their diet, along with insects, eggs, lizards and rodents. However, their large size and power also means that they sometimes hunt and kill larger prey such as young Gazelles. In areas where human settlements are encroaching on their natural habitats, Baboons are also known to raid crop fields which has led to them often being seen as pests. Baboons have very similar teeth to people with a series of large, flat molars which are perfect for grinding down vegetation and surplus food can be stored in their flexible cheek pouches to be saved for later.\n\nDue to their size and the fact that Baboons spend the majority of their lives on the ground, they are preyed upon by numerous predators throughout their natural range. Wildcats such as Lions, Leopards and Cheetahs are the most common predators of the Baboon along with large Pythons, African Wild Dogs and Birds of Prey that hunt the smaller and more vulnerable young. People however, pose the biggest threat to Baboons as they are often hunted and killed for meat and are even shot by farmers who consider them as pests, fearing for their crops. Their numbers though are being most affected by the loss of their once vast natural habitats, which are being subjected to deforestation for agriculture or land clearance for grazing and growing human settlements.\n\nBaboons have adapted remarkably well to the growing human populations throughout their natural range but the fact that they often raid crops has led to them being persecuted by farmers. They are also hunted and eaten as bushmeat in many areas of their native regions but it is their dwindling habitats that is causing the biggest problem for them. Vast areas of forest are cleared every day to make room for agriculture or to log the tropical timbers which means that Baboons have fewer areas where they can sleep safely in the trees. The grasslands are also dwindling in size as land is turned over to livestock for grazing or used for the expansion of growing settlements.",
      "family": "Cercopithecidae",
      "height": "50cm - 86cm (20in - 34in)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbaboon_one?alt=media&token=363f87bb-8063-439b-b8cb-78c44525048a",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbaboon_two?alt=media&token=7e28685c-a923-4a10-b67e-cd38c3fe3a44",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbaboon_three?alt=media&token=c5661e2c-6da8-43aa-ac1d-4a678a709565",
      "kingdom": "Animalia",
      "life_span": "15 - 40 years",
      "location": "Africa and Western Arabia",
      "name": "Baboon",
      "no_of_species": "5",
      "other_name": "Olive Baboon, Yellow Baboon, Guinea Baboon, Chacma Baboon, Hamadryas Baboon.",
      "scientific_name": "Papio",
      "weight": "14kg - 45kg (30lbs - 100lbs)"
    },
    {
      "detail": "The Bobcat is a medium-sized wildcat that is found in a variety of habitats across the southern half of North America. They are widespread and adaptable predators that are closely related to the larger and more northerly dwelling Canadian Lynx with the biggest difference being that the Bobcat only has a small bobbed tail, from which it gets its name. Measuring about double the size of a domestic cat, the Bobcat has the greatest range of all North American felines but their secretive nature means that they are seldom seen by people. There are currently twelve recognised sub-species of Bobcat which vary in their colouration and geographic range, with individuals found in mountainous forest being darker with more markings than their lighter-coloured cousins that are found in more arid, semi-desert regions.\n\nThe Bobcat is a carnivorous feline meaning that it only hunts and eats other animals in order to gain the nutrients that it needs to survive. Bobcats mainly hunt small mammals like Rabbits, Hares and Mice along with Birds close to the ground and the occasional Lizard. During the harsher winter months they are also known to hunt larger animals including Deer and will also feed on fresh carrion. The Bobcat is an incredibly elusive predator that hunts its prey by stalking it silently in the dark before pouncing on it with incredible force, and despite their size, Bobcats are known to be able to kill animals that are much larger than themselves. In areas where growing Human settlements have encroached on the Bobcat's natural habitat, they have also been known to take occasional livestock such as poultry and sheep.\n\nThe Bobcat is a fierce and dominant predator in its natural habitat with adult Bobcats therefore being threatened by few animals, the biggest concern to them being Cougars and Wolves. The small and vulnerable Bobcat kittens however, are preyed upon by a number of predators including Coyotes and Owls that are able to hunt the kittens whilst there mother has gone off to hunt. The biggest threat to Bobcat populations throughout North America is people that have previously hunted the Bobcat to near extinction in some areas for their soft fur. In areas where Bobcats are now forced to share their natural ranges with growing numbers of people, they have also been hunted by farmers who fear for their livestock. Despite the fact that they are very adaptable animals, Bobcats are also been threatened by habitat loss with populations being pushed into smaller and more isolated regions of their once vast natural range.",
      "family": "Felidae",
      "height": "4.1kg - 15.3g (9lbs - 33lbs)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbobcat_one?alt=media&token=84457157-3970-4863-bd41-f2c4f859cf75",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbobcat_two?alt=media&token=44c70e32-2d2e-4649-bcac-d116257b0eba",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbobcat_three?alt=media&token=59fca3ad-9774-4b20-848f-25c7d3a507af",
       "kingdom": "Animalia",
      "life_span": "12 - 15 years",
      "location": "North America",
      "name": "Bobcat",
      "no_of_species": "12",
      "other_name": "Red Lynx, Wildcat",
      "scientific_name": "Lynx rufus",
      "weight": "4.1kg - 15.3g (9lbs - 33lbs)"
    },
    {
      "detail": "The Bongo is a large species of antelope that is found inhabiting the jungles and forests of Eastern, Western and Central Africa. They are the largest forest-dwelling antelope species and one of the most distinctive, with a chestnut coloured coat and long horns that spiral as high as 90cm in males. There are two recognised sub-species of Bongo which are the Mountain Bongo (also known as the Eastern Bongo) and the Lowland Bongo (also known as the Western Bongo), which is primarily found in the forests of Central Africa. Both species of Bongo are threatened by both hunting and habitat loss with populations having declined significantly enough for it to be listed as a near threatened species by the IUCN, as although it still has a relatively wide distribution, populations are becoming more and more isolated.\n\nThe Bongo is a herbivorous mammal which means that they only feed on plant matter in order to gain the nutrition that they need to survive. Bongos are selective browsers that feed on leaves, roots, bark and grasses under the cover of night to keep them safer from the numerous carnivorous predators that they share their habitats with. The Bongo has a prehensile tongue which helps it to reach fresh leaves higher up and also aids it when pulling roots out of the ground. Like other antelopes (and cattle which they are closely related too), the Bongo has a four-chambered ruminating stomach to help it to break down the cellulose that the plants contain. Food passes through their digestive system very slowly in comparison to other mammals to maximise the nutritional intake.\n\nBongos are prey to numerous large predators in their surrounding environments with Leopards being their most common natural threat along with Lions in certain areas. The young calves are also vulnerable to predation from Pythons and Hyenas throughout much of their natural range. Another big threat to Bongos is the fact that they are particularly susceptible to disease with the entire population having been nearly wiped out in the late 1800s. They are however, at the biggest risk from people who don't just hunt them both directly and by setting snares but have also obliterated much of their one vast natural range through deforestation to both make way for agriculture and to gather tropical woods for the timber industry.",
      "family": "Bovidae",
      "height": "1.7m - 2.5m (5.5ft - 8.25ft)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbongo_one?alt=media&token=9b817b27-1f00-4866-9c75-c04b485ea0f4",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbongo_two?alt=media&token=123b5220-76c3-4d7b-b8d4-7adbb923cc4e",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbongo_three?alt=media&token=a9e70ba7-d1c5-4501-84ff-2d50f4371988",
      "kingdom": "Animalia",
      "life_span": "10 - 18 years",
      "location": "Western, Eastern and Central Africa",
      "name": "Bongo",
      "no_of_species": "2",
      "other_name": "Lowland Bongo, Mountain Bongo",
      "scientific_name": "Tragelaphus eurycerus",
      "weight": "150kg - 220kg (330lbs - 484lbs)"
    },
    {
      "detail": "Boxers are a bright, energetic and playful breed and tend to be very good with children. They are active dogs and require adequate exercise to prevent boredom-associated behaviours such as chewing or digging.Boxers have earned a slight reputation of being headstrong, which can be related to inappropriate obedience training. Owing to their intelligence and working breed characteristics, training based on corrections often has limited usefulness.\n\nBoxers, like other animals, respond much better to positive reinforcement techniques such as clicker training, which affords the dog an opportunity to think independently and to problem-solve.\n\nBoxers were originally a docked and cropped breed, and this tradition is still maintained in some countries. However, due to pressure from veterinary associations, animal rights groups and the general public, both cropping of the ears and docking of the tail have been prohibited in many countries around the world.",
      "family": "Canidae",
      "height": "",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fboxer_dog_one?alt=media&token=da4854c2-7281-4a0c-aa08-4977a8c94bfd",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fboxer_dog_two?alt=media&token=ed91c43e-a48d-48c3-9385-cf50e5be7e1c",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fboxer_dog_three?alt=media&token=8c7e32c7-d286-4f45-8d4e-cae507f7c3d0",
      "kingdom": "Animalia",
      "life_span": "",
      "location": "",
      "name": "Boxer Dog",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Canis Lupus",
      "weight": ""
    },
    {
      "detail": "Brown Bears are found in many parts of North America and Eurasia, where the bears inhabit wooded and mountainous areas. The brown bear is also the national animal for a number of states in North America, Europe and Asia.\n\nBrown bears are extremely large animals. Brown bears can grow to be five to eight feet tall and weight approximately 700 pounds. This means that the brown bear weight is about 75 percent as heavy as an Arabian horse, which weighs 930 pounds. Though some can be even larger. An Alaskan brown bear can weigh as much as 1500 pounds.In the spring after hibernation a brown bear may weigh much less. To make up for this, the bear may eat as much as 90 pounds of food per day to gain weight for the coming winter and its hibernation.They tend to be solitary animals; females and their brown bear cubs gather together and, at times, are known to congregate, especially at Alaska fishing spots. A group of bears is called a sloth or sleuth, but brown bears mostly live alone.\n\nBrown bears are omnivores; they are also top-of-the-food chain predators. They eat other animals such as rodents or moose. A large portion of their diet, however, consists of nuts, berries, fruit, leaves, and roots.They also enjoy fishing for salmon and crave the fats that can take them through the long winter of hibernation. Before it hibernates, the brown bear bear has been known to eat as much as 90 pounds of food per day.\n\nIn the past, brown bears were threatened by big game hunters, as trophies, and their hides and meats were used.Logging, mining and deforestation as well as destruction of habitat threatens the brown bear population. Human-and-bear conflict has been an issue, as bears can interfere with roaming livestock, water supplies, fruit orchards and trash bins.",
      "family": "Ursidae",
      "height": "1.5m - 2.8m (5ft - 9.2ft)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbrown_bear_one?alt=media&token=0d77fb9f-e369-4034-b776-525cb68f52b9",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbrown_bear_two?alt=media&token=2e42633b-6f53-48f2-902a-d9f98a9ed8b7",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbrown_bear_three?alt=media&token=feb20756-8d3b-40a4-8f4b-1fe06396496c",
      "kingdom": "Animalia",
      "life_span": "20 - 30 years",
      "location": "",
      "name": "Brown Bear",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Ursus Arctos",
      "weight": "136kg - 390kg (300lbs - 860lbs)"
    },
    {
      "detail": "Double-humped camels are called Bactrian camels. Two species roam the planet today: domesticated Bactrian camels and wild Bactrian camels. Unfortunately, wild Bactrians are teetering on the verge of extinction and also rank among the least-studied animals on Earth. If drastic measures aren’t implemented soon, they could cease to exist in 20 years. Conversely, domesticated Bactrian camels are thriving and boast population numbers in the millions. The one-humped dromedary camels are also plentiful.\n\nBactrian camels are between 225 to 350 centimeters (7.38 to 11.48 feet) long. From the top of their humps to the ground, they’re about 213 centimeters (6.9 feet) tall and usually tip the scales between 300 and 1,000 kilograms (660 to 2,200 pounds). They are the largest camel species, the largest mammal in their native range, and males are typically larger than females.Humps on wild Bactrian camels are smaller and more cone-shaped than the ones on domesticated Bactrians. Moreover, domesticated individuals have shorter legs and smoother fur. But both species have powerful muscles that help the animals stay upright when strong winds blow through.\n\nBactrian camels are omnivores in every sense of the word. While they prefer to dine on shrubs — including feather grass, tamarind trees, and saxaul trees — they will down whatever they can find. Camels won’t kill other land animals, but they will eat carcasses and suck the marrow from bones. They’ll also kill fish. If no meat or vegetation is available, camels have special enzymes that can digest tents, clothes, and shoes.Wild Bactrians can handle saltwater better than any other animal; however, domesticated ones aren’t as hardy. Both can extract nutrients from snow and ice though, which is a natural skill that many animals don’t have. Bactrian camels can also draw water from plants and bark.Speaking of water, camels can down over 100 liters (22 gallons) in under 10 minutes! That’s the equivalent of drinking 300 glasses of water in 10 minutes! Because of their ability to consume so much at once, camels can go for weeks between feedings.",
      "family": "Camelidae",
      "height": "1.7m - 2.1m (5.5ft - 7ft)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbactrian_camel_one?alt=media&token=9d790a82-01d2-4815-a1d6-ce5461def35e",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbactrian_camel_two?alt=media&token=c84dabca-7689-457d-bbd8-22449f3c66b4",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbactrian_camel_three?alt=media&token=1a1ad406-5b69-4b06-8f1e-2e111295df14",

      "kingdom": "Animalia",
      "life_span": "35 - 50 years",
      "location": "",
      "name": "Bactrian Camel",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Camelus Bactrianus",
      "weight": "600kg - 816kg (1,322lbs - 1,800lbs)"
    },
    {
      "detail": "Barn owls are one of the most widely distributed birds found everywhere around the world apart from the polar and desert regions. Although this is the case, the barn owl population is more predominant in the Southern Hemisphere due to better climate conditions for the barn owl.\n\nBarn owls tend to measure between 25 and 40cm tall and adult barn owls can have a wingspan of up to 110cm long. The wing span of the barn owl is however dependent on the species of barn owl so some owls may be smaller, where other species of barn owl may be much bigger.\n\nBarn owls most commonly hunt small mammals such as mice, voles and rats but barn owls also hunt fish close to the surface of the water and smaller birds in the tree tops and even in the air. Barn owls swallow their prey whole and then bring back up (regurgitate) the indigestible parts such as bones in the form of a small pellet.\n\nFemale barn owls lay a clutch of up to 7 eggs in the warm months of spring. The female barn owl nests in a hollow tree or rock, and the barn owl eggs usually hatch after about a month. The male barn owl is known to help feed the barn owl chicks and the barn owl chicks are able to fly by the time they are 12 weeks old.\n\nThere are more than 30 different species of barn owl found across Europe, Africa, Asia and parts of Australia and the Americas. All barn owl species have a similar appearance but can differ great in both size and colour.",
      "family": "Tytonidae",
      "height": "25cm - 45cm (9.8in - 18in)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbarn_owl_one?alt=media&token=f2d2cd28-4edf-4e9b-94d3-214e9cead6a5",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbarn_owl_two?alt=media&token=d4aafd1e-c0d9-43d4-960b-c57da733d8f9",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbarn_owl_three?alt=media&token=c8a25fe4-ae6d-4b05-802f-c5d69d0fd928",

      "kingdom": "Animalia",
      "life_span": "5 - 10 years",
      "location": "",
      "name": "Barn Owl",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Tyto Alba",
      "weight": "300g - 550g (10oz - 19.4oz)"
    },
    {
      "detail": "There are 47 species of bats living in the United States. Bats live in many types of environments except in extremely cold places (polar regions) and extremely hot ones (deserts). Bats are important pollinators and help to control the population of insects. These animals are social and live in groups that can number in the hundreds of thousands! Though vampire bats are the most well-known, there are only three species of bat that use another animal’s blood as food.\n\nBats eat insects such as mosquitoes,moths, cockroaches and beetles. A little brown bat can eat 500 insects in one hour. A colony of bats can consume 500,000 pounds of bugs per night. 500,000 pounds of bugs is equal to the weight of two blue whales!Bats use echolocation to find their prey. As a bat flies, it lets out high-pitched squeaks and clicks that humans can’t hear. When the soundwaves created by a bat’s squeak hit an object, the sound echoes back to the bat. Think of echolocation as a bat’s personal radar system.\n\nBats have a few predators including owls, falcons, eagles, snakes, raccoons and cats. An owl may sit on a tree near a cave or bridge where a bat is sleeping and capture it as it flies out to hunt in the evening. Alternatively, a raccoon or snake may pick up a baby bat that’s fallen from its mother’s grasp and landed on the ground.",
      "family": "Microchiroptera",
      "height": "3cm - 180cm (1.2in - 71in)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbat_one?alt=media&token=bbdcb18a-35dc-46e9-ae83-d4d44e412e36",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbeaver_two?alt=media&token=55005d32-bbfe-4384-9c1c-446726631ea7",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbeaver_three?alt=media&token=4878264c-887d-4505-9621-8b34574be411",

      "images": [
        {
          "image": ""
        },
        {
          "image": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbat_two?alt=media&token=2a378323-24b8-450e-9943-04c24b44ac6a"
        },
        {
          "image": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbat_three?alt=media&token=3482c290-5b8a-4f8d-aefb-9530af269e30"
        }
      ],
      "kingdom": "Microchiroptera",
      "life_span": "10 - 30 years",
      "location": "",
      "name": "Bat",
      "no_of_species": "47",
      "other_name": "",
      "scientific_name": "Chiroptera",
      "weight": "2g - 1,000g (0.07oz - 35oz)"
    },
    {
      "detail": "Beavers are most well known for their distinctive home-building that can be seen in rivers and streams. The beavers dam is built from twigs, sticks, leaves and mud and are surprisingly strong. Here the beavers can catch their food and swim in the water.\n\nBeavers are nocturnal animals existing in the forests of Europe and North America (the Canadian beaver is the most common beaver). Beavers use their large, flat shaped tails, to help with dam building and it also allows the beavers to swim at speeds of up to 30 knots per hour.\n\nThe beaver colonies create one or more dams in the beaver colonies' habitat to provide still, deep water to protect the beavers against predators. The beavers also use the deep water created using beaver dams and to float food and building materials along the river.\n\nBeavers are known for their danger signal which the beaver makes when the beaver is startled or frightened. A swimming beaver will rapidly dive while forcefully slapping the water with its broad tail. This means that the beaver creates a loud slapping noise, which can be heard over large distances above and below water. This beaver warning noise serves as a warning to beavers in the area. Once a beaver has made this danger signal, nearby beavers dive and may not come back up for some time.\n\nBeavers are slow on land, but the beavers are good swimmers that can stay under water for as long as 15 minutes at a time. In the winter the beaver does not hibernate but instead stores sticks and logs underwater that the beaver can then feed on through the cold winter.",
      "family": "Castoridae",
      "height": "80cm - 120cm (31in - 47in)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbeaver_one?alt=media&token=dd1f92c9-d395-4a20-92e4-275b2cd92fda",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbeaver_two?alt=media&token=55005d32-bbfe-4384-9c1c-446726631ea7",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbeaver_three?alt=media&token=4878264c-887d-4505-9621-8b34574be411",

      "kingdom": "Animalia",
      "life_span": "15 - 20 years",
      "location": "",
      "name": "Beaver",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Castor Canadensis",
      "weight": "16kg - 27kg (35lbs - 60lbs)"
    },
    {
      "detail": "One of the most wondrous and iconic animals to walk the Earth, Bengal tigers are majestic and rare. They're also one of the biggest cat species in the world. On average, Bengals are larger than other tiger species, but the largest tiger ever recorded was a Siberian. As such, Bengals are considered the second largest tiger species.Today, wild Bengal tigers only live in Bangladesh, Bhutan, India, and Nepal. And while there are more Bengals than any other tiger subspecies on the Indian subcontinent, the populations are endangered.\n\nBengal tigers are one of the biggest subspecies of cats roaming the Earth today.The majority of Bengal tigers sport yellow to light orange coats with brown to black stripes, but their bellies and the inward-facing sides of their limbs are white.\n\nMale Bengal tigers are typically between 9 to 10 feet long, including the tail, and about 3 to 3.5 feet tall from the ground. On average, boy Bengals tip the scale between 397 and 569 pounds — which is about the same weight as a pig and half as heavy as a polar bear.\n\nFemales are slightly smaller than their male counterparts. They’re usually between 7.5 to 8.5 feet long, and while the same height as the males, only weigh about 220 to 350 pounds, about the same size as a reindeer.\n\nBengal tigers, like all tigers, are carnivores. Their favorite meat comes from large, hooved mammals, including chital, gaur, and sambar. In a pinch, they’ll also prey on barasingha, water buffalo, nilgai, serow, takin, wild boar, hog deer, Indian muntjac, porcupines, hares, leopards, wolves, crocodiles, dhole, and peafowl. Increasing evidence also suggests that Bengal tigers will coordinate attacks against rhinoceros and elephants.\n\nPoaching and habitat destruction, which causes population fragmentation, are the main threats to Bengal tigers. Though lawmakers have implemented anti-poaching laws to protect big game, it remains a huge problem. A thriving and lucrative black market for skins and body parts — which pays a year's salary for one kill — unfortunately encourages people to break the laws and hunt tigers.",
      "family": "Felidae",
      "height": "2.4m - 3.3m (6.8ft - 11ft)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbengal_tiger_one?alt=media&token=fed3f5dc-e95f-4cbb-bce7-7bab6ecbcbdb",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbengal_tiger_two?alt=media&token=9fd047c9-2029-422f-b41d-546d2fb6eb50",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbengal_tiger_three?alt=media&token=6ea4ee11-871e-48e0-bbaa-9eadc6cb8ae6",

      "kingdom": "Animalia",
      "life_span": "18 - 25 years",
      "location": "",
      "name": "Bengal Tiger",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Panthera Tigris Tigris",
      "weight": "140kg - 300kg (309lbs - 660lbs)"
    },
    {
      "detail": "The Blue Whale is an enormous species of whale that is found in subtropical and polar waters worldwide. With some individuals growing to more than 100ft long, the Blue Whale is not only the largest animal species in the world but it is also thought that it could be the biggest creature that has ever existed. There are three recognised sub-species of the Blue Whale which are the Northern Blue Whale, the Southern Blue Whale and the Pygmy Blue Whale that despite its name, still reaches an average length of 24 meters. Although their enormous size and slow-maturing nature has meant that the world's Blue Whale population has never been greatly numerous, they have drastically declined in numbers due to having been hunted by Humans particularly over the past 100 years. Blue Whales are now legally protected and despite one not having been deliberately caught since the 1970s, their numbers are continuing to fall in much of their natural range.\n\nThe Blue Whale is a carnivorous animal that despite the fact that it doesn't have proper teeth, survives on a diet that is mainly comprised of krill and small crustaceans, along with the occasional small fish. Blue Whales feed by swimming up towards a shoal of prey and thanks to the pleats on their neck which allows their throat to expand, take an enormous gulp of water into the sac created in their lower jaw and shut their mouths. The water is then expelled but thousands of tiny creatures are retained by their fine baleen plates which are then swallowed. Blue Whales are able to consume up to six tonnes of prey every day during the summer months which they spend in the cold, rich waters around the poles. Although Blue Whales are known to eat a tremendous amount during the summer, when they migrate to the warmer waters for winter to breed they will barely eat anything at all.\n\nDue to the immense size of an adult Blue Whale, they have no natural predators in the ocean with people being their biggest threat. Young Blue Whale calves however, are more vulnerable particularly once they have left the safer, warmer waters of their nursery and begin to travel throughout the more dangerous seas. Blue Whale calves are preyed upon by pods of Killer Whales that are able to use their intelligence and team work to catch and kill such a large animal. However, when Blue Whale hunting began in the 1800s with the invention of a more technical harpoon the biggest trouble for Blue Whales began. With increasingly better technologies, the situation escalated in the 1900s and decimated the global Blue Whale population, with people hunting them for their meat and blubber until an international ban finally gave them some protection in the 1960s.\n\nThe Blue Whale is the largest animal on the planet meaning that numerous organs are much, much bigger than those found in any other animal. Apparently just one breath from a fully grown adult Blue Whale, will produce enough air to fill nearly 2,000 balloons! Also, the heart of the Blue Whale is so big that it is around the same size as a small car, with their main arteries being big enough for a human to swim through comfortably! Being mammals, Blue Whales must come to the surface to breathe in air but also have to expel it and do so by blowing all of the warm, humid air, mucus and sea-water out of their lungs through their two blow-holes and into the air. Blue Whales do this with such force that this column can shoot as high as nine meters into the sky.",
      "family": "Balaenopteridae",
      "height": "25m - 30m (82.5ft - 100ft)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fwhale_one?alt=media&token=9a3dd172-fe56-46dd-a4f7-a2ef3f0bbdb6",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fwhale_two?alt=media&token=1df8e1fe-433a-46c1-8941-57d5592b9c29",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fwhale_three?alt=media&token=ed4236c8-342e-4555-b624-4acdfd41991f",

      "kingdom": "Animalia",
      "life_span": "30 - 45 years",
      "location": "Oceans worldwide",
      "name": "Blue Whale",
      "no_of_species": "3",
      "other_name": "Northern, Southern, Pygmy",
      "scientific_name": "Balsenoptera musculus",
      "weight": "100tonnes - 160tonnes (220,000lbs - 352,000lbs)"
    },
    {
      "detail": "Bull sharks get their name from the short, blunt shape of their snouts and their aggressive behavior. They also usually butt prey with their heads before attacking. These sharks are found in warm coastal waters less than 100 feet (30 m) deep, but they can swim far up freshwater rivers and live in freshwater lakes if they choose. They are the third most dangerous sharks towards people, just behind the great white shark and the tiger shark. Their overall shape is large and stocky, with heavy, rounded bodies.\n\nThe bull shark can be found around the world, anywhere where there are warm, shallow, coastal waters. They also live in many rivers around the world at least part-time. They’ve been found in the Amazon River in South America, the Mississippi River in the United States, the Brisbane River in Australia, the Tigris River in the Middle East, and the Ganges River in India. They also live at least part-time in various freshwater lakes, including Lake Nicaragua in Nicaragua and Lake Pontchartrain in Louisiana.\n\nBull sharks are carnivores, meaning their diet is made up of meat, including fish. They are opportunistic feeders, which means that they eat just about anything they find, and they aren’t picky about their food. Their main diet consists of fish, dolphins, sea turtles, rays, birds, and other sharks, including other bull sharks.How much they eat depends on what is available. If food is plentiful, they will eat as much as they can. If food is scarce, bull sharks can go long periods without eating. When this happens, their digestion slows down to make the food last longer and allow them to avoid starvation. It is not known just how much a bull shark needs to eat.\n\nAdult bull sharks are not generally preyed upon by anything that lives in the ocean. That makes them what is called an “apex predator,” which is an animal that is at the top of the food chain. Juvenile bull sharks are sometimes eaten by other sharks, including adult bull sharks. Bull sharks have been seen being attacked and killed by crocodiles in rivers in both Australia and South Africa.\n\nThe main threat to bull sharks is humans. They are hunted by people for their oil, hide, and meat. The numbers of bull sharks appear to be shrinking, and at least one study has found that bull sharks are not growing as large as they used to, most likely due to the bigger ones being killed.",
      "family": "Carcharhinidae",
      "height": "2.1m - 3.5m (7ft - 11.5ft)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbull_shark_one?alt=media&token=5eda18d8-21ed-41df-ac88-f713af7018e1",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbull_shark_two?alt=media&token=e8920331-b435-4344-a330-7bb557440850",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbull_shark_three?alt=media&token=c171a15a-3fe5-4e8a-bb26-1bb70d84a03e",

      "kingdom": "Animalia",
      "life_span": "16 - 25 years",
      "location": "",
      "name": "Bull Shark",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Carcharhinus Leucas",
      "weight": "90kg - 230kg (200lbs - 500lbs)"
    },
    {
      "detail": "The bullfrog is one of the most widely distributed frogs across the North American continent. The bullfrog is a medium-sized frog that is best known for its loud cow-like calls, hence its name.\n\nBullfrogs are found in a wide range of permanent freshwater habitats including ponds, swamps and lakes where the bullfrog tends to prefer to be closer to the banks rather than out in the open water. Bullfrogs also prefer to be in warmer climates rather than the cooler ones.\n\nBullfrogs are carnivorous animals and bullfrogs have a diet that is meat-based. Bullfrogs are nocturnal hunters, hiding and resting during the day and actively hunting by night. Bullfrogs hunt a variety of insects and their larvae, eggs, spiders and even small fish. Some of the larger bullfrogs, today found in South Korea, have been even known to eat small snakes.\n\nDue to the relatively small size of the bullfrog and the fact that its calls can be heard for some distance, the bullfrog has numerous different predators within its natural environment. Aquatic animals including large fish and river turtles are the most common predators of the bullfrog along with a number of snake species.\n\nBullfrog breeding occurs around late spring to early summer, when the male bullfrogs call out to the female bullfrogs attracting them into their territory. Once the bullfrogs have mated, the female bullfrog can lay around 20,000 eggs which float together on the surface of the water.\n\nThe bullfrog eggs hatch in less than a week, and thousands of bullfrog tadpoles emerge into the surrounding water. The tadpoles begin to develop limbs and start to look like adult frogs. This whole process can take anywhere from 3 months to 3 years, depending on where the bullfrog lives.",
      "family": "Ranidae",
      "height": "9cm - 15cm (3.5in - 6in)",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbullfrog_one?alt=media&token=b69ccf16-7101-4aee-9564-72999daa4894",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbullfrog_two?alt=media&token=67425056-f1b5-4d49-8b3a-cae2c300ce4a",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbullfrog_three?alt=media&token=27fb0811-7af6-41da-b14a-5bc406eafd39",

      "kingdom": "Animalia",
      "life_span": "6 - 10 years",
      "location": "",
      "name": "Bullfrog",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Rana Catesbeiana",
      "weight": "300g - 500g (10.5oz - 17.6oz)"
    },
    {
      "detail": "Bison are the largest mammal in North America and have long dazzled the imaginations of native peoples and American settlers.The average adult found in North America is two meters — or 6 feet 2 inches — tall. That’s taller than basketball legend Michal Jordan! Lengthwise, they can reach 3 meters, which is 11 feet. European bison are slightly taller but squatter, measuring 2.1 meters — or 6 feet 11 inches — tall and 2.9 meters — or 9 feet 6 inches — long.\n\nWhen it comes to weight, American bison tip the scales between 400 and 1,270 kilograms, which calculates to about 880 and 2,800 pounds. European bison typically fall between 800 and 1,000 kilograms, or 1,800 to 2,200 pounds. To put it another way, bison weigh about as much as a car.\n\nCold-weather bison sport long and shaggy hair. Ones that live in warmer climates have shorter fur. When born, bison are a red-orange color. At around two months old, the red starts turning into dark brown. In colder months, bison grow thicker fur coats that they shed in the summer months.\n\nAmerican Bison are nomadic vegetarians. Their diet consists of 93 percent grass, 5 percent flowering shrubs, and 2 percent vegetation that hangs from trees. To remain healthy, bison must eat 1.6 percent of their body mass per day, which averages to about 24 pounds of daily vegetation — or two bowling balls worth of grass and plants!Bison migrate with the vegetation and go where the most nutritious options grow based on the time of year. Like other livestock, they need to avoid toxic plants, like hemlock, arrowgrass, death camas, and milk vetch. Bison have a ruminant digestive system, meaning they can ferment and isolate nutrients in a special compartment in their stomachs.\n\nAt times bison are peaceful and lazy. Other times, they can be bold and dangerous without warning. Mothers grow especially protective if they sense a threat near their calves. Humans should not get closer than 25 feet to bison at a minimum. \n\nBison generally live in gender-specific herds for part of the year. When male bison — or bulls — reach two years old, they leave their mothers and join a male pack called a “bachelor herd.” Female herds are usually larger than male ones and have a matriarch that makes the big decisions, like where to graze and when to sleep. Every year, female and male herds join up for the mating season. ",
      "family": "Bovidae",
      "height": "2m - 2.7m (6.6ft - 9ft)",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbison_one?alt=media&token=ace492f3-47ce-40f5-a2b7-dc5573bf4e00",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbison_two?alt=media&token=1e58f78b-fece-40a0-8e60-9822bb13b37c",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbison_three?alt=media&token=5b4c66f3-fdfb-4445-88a3-bafa4c7ad291",

      "kingdom": "Animalia",
      "life_span": "15 - 20 years",
      "location": "",
      "name": "Bison",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Bison Bison",
      "weight": "1,000kg - 1,300kg (2,200lbs - 2,500lbs)"
    },
    {
      "detail": "All African buffalo are large and cattle-like, though they don’t share a close genetic link to cattle. The males average 1,600 pounds as adults--about as big as a four-wheeler! They also stand about five feet tall at the shoulder and reach as long as seven feet from nose to tail. Despite their size, a charging buffalo can reach up to 37 miles per hour.\n\nAfrican buffaloes come in four varieties. These include the cape, West Africa savanna, Central Africa savanna and forest buffalo, and are mostly distinguished by their horn shape and relative size. The most common are the Cape buffalos, who have dark-brown coating of short, coarse fur and large, distinctive horns that curl downward and then back up, similar to a ram. Savanna buffalo are similar to Cape buffalo, but with slightly shorter horns and a wide range of fur styles ranging from light brown to virtual black. Forest buffalo are generally smaller than the others, with lighter brown (or even reddish) fur and shorter horns. Younger savanna buffalo sometimes have light brown fur as well, but most forest buffalo keep theirs into adulthood.\n\nBuffaloes congregate in large herds, with each herd featuring anywhere from 50 to 500 members. Sometimes herds will join to create temporary super-herds, numbering in the thousands, to keep lions and other predators from easily singling out single members for attack. Any herd is typically made up of females and their calves.\n\nAfrican buffalo can survive almost anywhere there is water. This includes swamps, semi-arid brushland and forests. They live throughout the continent of Africa, particularly central and southern Africa. Countries include Sierra Leone, Ghana, Cameroon, Kenya, Central African Republic, South Africa, Botswana and more.\n\nDespite their sometimes violent nature, buffaloes don’t eat meat. Like many hooved animals, they spend their waking moments grazing on plants. Though they only have a very distant evolutionary link to cows and other bovines, buffalo will chew cud just like a cow. That means, they will spit up grass from earlier to re-chew and extract more nutrients.",
      "family": "Bovidae",
      "height": "600kg - 907kg (1,323lbs - 2,000lbs)",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbuffalo_one?alt=media&token=aead183e-3fd5-428c-8eac-fe128a4b901a",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbuffalo_two?alt=media&token=21d38d7c-d35d-4d2a-8d23-d8d804df50ef",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fbuffalo_three?alt=media&token=6735ad17-2d20-49e5-b0c5-f3d2c6f696d2",

      "kingdom": "Bovidae",
      "life_span": "15 - 22 years",
      "location": "",
      "name": "Buffalo",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Syncerus Caffer",
      "weight": "600kg - 907kg (1,323lbs - 2,000lbs)"
    },
    {
      "detail": "The Cheetah is a large and powerful feline that was once found throughout Africa and Asia and even in parts of Europe. Today however, it is found in only a few remote regions of its once vast natural range, primarily due to growing Human settlements and the hunting of them for their fur. There are widely considered to be five different subspecies of Cheetah that vary only very slightly in colouration and are most easily distinguished by their geographic location. Although they are not considered to be part of the 'big cat' family as they cannot roar, Cheetahs are one of Africa's most powerful predators and are most renowned for their immense speed when in a chase. Capable of reaching speeds of more than 60mph for short periods of time, the Cheetah is the fastest land mammal in the world.\n\nThe Cheetah has a long and slender body that is covered in coarse yellowish fur and dotted with small black spots. Its long tail helps with balance and changing direction quickly and unlike the rest of the Cheetah's body, there are ringed markings along the tail which ends in a black tip. Cheetahs have small heads with high set eyes that aid them when surveying the surrounding grasslands for potential prey. They also have distinctive black tear marks that run from the inner eye, along their nose and down to the outside of their mouths, which are thought to help protect them from being blinded by the bright sun. The exceptional speed of the Cheetah is caused by a number of things including having strong and powerful hind legs, and an incredibly flexible and muscular spine which allows the Cheetah to not only sprint quickly but also makes them very agile. They also have non-retractable claws which dig into the ground, giving the Cheetah better grip at high speed.\n\nThe Cheetah has exceptional eyesight and so hunts using sight by first stalking its prey (from between 10 to 30 meters away), and then chasing it when the time is right. Cheetahs often kill their prey in vast open spaces but tend to drag it into a hiding place to prevent it from being scavenged by other animals. The Cheetah has to do this as it cannot eat its prey straight away, due to the fact that they are immensely hot after the chase and need time to cool down before they can feast. Cheetahs are carnivorous animals meaning that they only hunt and kill other animals in order to get the nutrition that they need to survive. They mainly hunt large herbivores including Gazelle and a number of large Antelope species such as Wildebeest, along with Zebras and smaller mammals like Hares. The exact diet of the Cheetah though tends to depend on its location.\n\nThe adult Cheetah is a dominant predator in its environment and is therefore not seen as prey (more as competition) by other large predators. The Cheetah cubs however, are incredibly vulnerable particularly when their mother is off hunting, and are preyed upon by a number of animals including Lions and Hyenas, but also large avian species such as Eagles and Vultures.",
      "family": "Felidae",
      "height": "115cm - 136cm (45in - 53in)",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fcheetah_one?alt=media&token=c119c12b-80ce-4e83-af11-4f28d214f731",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fcheetah_two?alt=media&token=52fdbde8-363c-4cc4-8fce-9cd1b5c0eda1",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fcheetah_three?alt=media&token=b0029af1-04f0-49bb-8594-049b5934612f",

      "kingdom": "Animalia",
      "life_span": "10 - 12 years",
      "location": "Asia and Africa",
      "name": "Cheetah",
      "no_of_species": "5",
      "other_name": "",
      "scientific_name": "Acinonyx jubatus",
      "weight": "40kg - 65kg (88lbs - 140lbs)"
    },
    {
      "detail": "Chipmunks are small squirrel-like rodents that are native to North America, although one species is found in some European countries.Chipmunks eat a wide variety of wildlife like frogs, mushrooms, birds, eggs, plants nuts and seeds. In the autumn, the chipmunks begin to gather their winter food stash, which they store in their burrows to last them until spring.\n\nThe most common chipmunks are the red coloured chipmunks with light brown stripes on their back. These are North American chipmunks. Chipmunks are also becoming more popular as pets.There are 25 different species of chipmunk living in the North American forests. The chipmunk is often referred to as a small squirrel due to the obvious similarities between the two mammals.\n\nThe chipmunk plays a vital within the forest eco-system which the chipmunk inhabits through the dispersing of seeds when the chipmunk eats the fruits and berries that the forest plants produce and the chipmunk chews on the wood of plant stalks and tree trunks which disperses the spores from the plant into the surrounding forest.\n\nChipmunks construct extensive underground burrows which can be more than 3.5 m in length and these chipmunk burrows often have several well-concealed entrances to keep the chipmunk burrow a secret from unwanted predators. Within the chipmunk burrow, the chipmunk sleeping quarters are kept extremely clean as the chipmunks keep nut shells and faeces stored in separate refuse tunnels.",
      "family": "Sciuridae",
      "height": "10cm - 18cm (4in - 7in)",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fchipmunk_one?alt=media&token=d4c84613-e185-4a96-83b4-7db78509ce39",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fchipmunk_two?alt=media&token=d62e143d-be11-4954-a4b5-5033defe34eb",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fchipmunk_three?alt=media&token=e246d51f-247a-4cd2-a5f4-5ac91570397f",

      "kingdom": "Animalia",
      "life_span": "4 - 8 years",
      "location": "",
      "name": "Chipmunk",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Tamias Striatus",
      "weight": "57g - 113g (2oz - 4oz)"
    },
    {
      "detail": "Coatis are furry animals that are native to South America. They usually exist in Mexico, Central America, South America, and the Southwestern United States. Their name coatimundi is known to be derived from the Tupian Brazil languages.The name ‘Coati’ originated from the Spanish word “coatí,” which goes back to Old Tupi. The visually descriptive name is due to the coati’s habit of sticking their noses into their bellies when they sleep. The creature's scientific name 'Nasua' also comes from the Latin word meaning 'nose'.\n\nCoatis have a sleek and slender head. Their noses are the highlight of their faces and are usually long and flexible. These furry creatures have small ears, a long tail, and dark feet. They often use their tails for balancing their bodies. Their fur coats usually come in black or brown color with a lighter underpart. Coatis are about 12 inches in height and usually weigh between 4 to 18 lbs.Their front feet are equipped with curved claws that are relatively long. The back feet, however, have shorter claws. Their toes are webbed, and they are known to be powerful swimmers. The male coati is known to be double the size of female ones and has sharp canines.\n\nOmnivorous in nature, coatis have a diet that includes a variety of things like lizards, eggs, birds, and crocodile eggs. They also eat fruit as well as invertebrates - which they dig out from beneath the ground using their long claws. They are known to travel a lot in search of food.\n\nLike all the other animals, coatis are also a part of the environmental food chain and there are a lot of animals that prey on them. These predators include maned wolves, anacondas, tayras, dogs, and foxes. Some other animals that are known to prey on them are ocelots, raptors, eagles, jaguarundis, and boa constrictors.",
      "family": "Procyonidae",
      "height": "",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fcoati_one?alt=media&token=3a4b0835-ce0f-4bab-b109-87d7bdb1805b",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fcoati_two?alt=media&token=e0411176-442d-4f5b-909d-83f847f85f42",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fcoati_three?alt=media&token=a186b674-62be-4dc6-97e1-305ac3bf1e40",

      "kingdom": "Animalia",
      "life_span": "8-15 years",
      "location": "",
      "name": "Coati",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Nasua nasua",
      "weight": "3-8kg (6-18lbs)"
    },
    {
      "detail": "Cows survive in many climates and places. The indicus subspecies is better suited to tropical environments, while taurus cows can survive easily in wintery climates. In general, cows need access to a wide range of space, so they can graze on grasses. Whether in the mountains, jungle or wide open plains, cows can adapt to many different environments.",
      "family": "Bovidae",
      "height": "400kg - 800kg (881lbs - 1,760lbs)",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fcow_one?alt=media&token=2022db38-24b8-443c-83e4-ac2c782ce4e1",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fcow_two?alt=media&token=df0e356b-485d-4313-9dcd-41e5bf997043",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fcow_three?alt=media&token=d7791d90-80fd-4900-9bd9-7e5131f7a228",

      "kingdom": "Bovidae",
      "life_span": "12 - 20 years",
      "location": "",
      "name": "Cow",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Bos Taurus",
      "weight": "400kg - 800kg (881lbs - 1,760lbs)"
    },
    {
      "detail": "Crocodiles are one of the most well-known and fearsome animals in the world. Their powerful bodies, strong jaws and immense speed and agility along with their unparalleled stealth, has lead to them being one of the world's most apex predators in their natural environments. Closely related to other crocodilians including alligators, caimans, and gharials, crocodiles have changed very little in an evolutionary sense in 200 million years. Unlike other reptile species, crocodilians are archosaurs which is an ancient group of reptiles that also included dinosaurs. Although dinosaurs became extinct 65 million years ago, crocodiles are thought to have survived so well over time due to the fact that they are so well suited to their environments. Today, there are 13 different crocodile species that are found inhabiting both fresh and saltwater environments throughout North and South America, Africa, Asia and Australia. Their semi-aquatic nature has led to them evolving a number of key adaptations that allow them to survive so successfully in their natural environments.\n\nCrocodiles are large sized reptiles with thick, scaly skin that is made up of armoured, waterproof plates that both protects them from potential predators and also prevents their bodies from drying out. These scales come in a variety of colours from dull olive and green, to brown, greys and black meaning that they are very easily camouflaged in the surrounding water and vegetation. Like other crocodilian species, their eyes and nostrils are located on the very top of their broad head and snout so that they can lay in wait in the water with almost none of their bodies exposed in order to more successfully ambush prey. Their vertically flattened tails are immensely strong and are used to propel them through the water, as although they do have webbed feet, they do not use them to aid them when swimming. In order to protect them in the water, crocodiles have a special transparent third eyelid which allows them to leave their eyes open but prevents damage from the water. They also have external flaps that close off their ears and nostrils, and a special respiratory system that allows them to remain in the water for up to five hours at a time.\n\nCrocodiles are not able to regulate their body temperature themselves and instead rely heavily on the heat of the sun to warm their enormous bodies up. During the hot daylight hours, they bask in the sun on the riverbanks warming their bodies up from a night of hunting. Crocodiles are highly sociable animals that remain together in large, mixed groups of adults and juveniles. However, when the mating season begins, the males become highly territorial and protect their stretch of river bank from intrusion by competitors by rearing their large heads high up into the air and and roaring at intruders. When female Nile crocodiles are attracted by these noises, the males begin to thrash their bodies around and even shoot water into the air from their nostrils.\n\nCrocodiles are highly carnivorous and formidable predators and at the top of the food chain in their natural environments. Their inability to chew food has led to the development of ambush hunting techniques, and strong powerful jaws with teeth that are used to tear food apart. Young crocodiles rely heavily on fish, crustaceans, and small mammals, birds and reptiles, but as they grow larger they are able to take much bigger prey species including, deer, zebra and water buffalo. Crocodiles are often more active during the night, with some species being known to venture onto land to catch prey, livestock and in some cases, people. Due to their highly sociable nature, Nile crocodiles (which predominantly feed on fish), are known to work together in order to cordon fish off in sections of river when they are migrating. Catfish make up a large portion of their natural diets and by keeping their numbers at bay, this allows small fish species to still thrive. These fish (which would ordinarily be quickly eaten by the larger catfish) then provide food for over 40 species of bird, that in return fertilise the waters with their droppings and keep them rich with nutrients so numerous animal species can continue to thrive. ",
      "family": "Crocodylus acutus",
      "height": "18kg - 1,000kg (40lbs - 2,200lbs)",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fcrocodile_one?alt=media&token=702889fd-6f28-4fcd-b8c6-95d462768a02",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fcrocodile_two?alt=media&token=4ee68541-0623-4910-a503-da6d43707ce9",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fcrocodile_three?alt=media&token=71ac2fd2-e849-4d4b-851b-69cacadc8c8e",

      "kingdom": "Crocodylus acutus",
      "life_span": "18kg - 1,000kg (40lbs - 2,200lbs)",
      "location": "North, Central and South America, Africa, Asia, Australia",
      "name": "Crocodile",
      "no_of_species": "13",
      "other_name": "American crocodile, Orinoco crocodile, Freshwater crocodile, Philippine crocodile, Mexican crocodile, Nile crocodile, New Guinea crocodile, Mugger crocodile, Estuarine crocodile, Cuban crocodile, Siamese crocodile, Dwarf crocodile, Slender-snouted crocodile.",
      "scientific_name": "Crocodylus acutus",
      "weight": "18kg - 1,000kg (40lbs - 2,200lbs)"
    },
    {
      "detail": "Cats  seem to date back to around ancient Egyptian times, when they were worshipped and heralded as sacred animals to the Gods in Egypt. The cat has since become an honored and valued member of family homes worldwide.\n\nA cat's senses are superior amongst the animal world, with exceptional sight, smell and taste, cats are able to subtly sneak up on, and catch their prey with immense success.\n\nDespite the cats unbeatable night-vision, a cats eyesight during the day is actually not too dissimilar from humans! Due to this, cats are more nocturnal hunters looking for small rodents and birds.\n\nThe average domestic cat sleeps for around 18 hours a day and tends to spend their waking time hunting for food. Despite wild cats being solitary animals, the domestic cat is known to enjoy attention from humans and other animals and will often even get on well with some dogs.",
      "family": "Felidae",
      "height": "",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fcat_one?alt=media&token=0e20bc13-b094-46d8-a0f2-63a4cfa60140",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fcat_two?alt=media&token=95a3a8d1-3f20-43dc-b3e0-da05232f5862",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fcat_three?alt=media&token=de75c0fc-01ad-46e3-a474-c02c5b09de29",

      "kingdom": "Felidae",
      "life_span": "4.5kg (10lbs)",
      "location": "",
      "name": "Cat",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Felis catus",
      "weight": "4.5kg (10lbs)"
    },
    {
      "detail": "The Chimpanzee is a species of ape that is natively found in a variety of different habitats in western and central Africa. Closely related to other great apes including Orang-Utans and Gorillas, the Chimpanzee is also very closely related to Humans as we share 98% of the same DNA. They are thought to be the most intelligent animals on the planet after people and are not only known to show emotion but they are also great problem-solvers and are even known to not just use, but also make tools to help them to survive more successfully in their surroundings. There are two different species of Chimpanzee which are the Common Chimpanzee and the smaller Bonobo (also known as the Pygmy Chimpanzee) which has a limited distribution south of the Congo River. However, despite being highly adaptable and intelligent creatures, Chimpanzees are severely threatened in their natural habitats today, mainly due to hunting for bushmeat and deforestation.\n\nChimpanzees are large primates that have long yet sparse black hairs covering their bodies with the exception of their face, palms and the soles of their feet. Their hair not only allows them to remain warm in areas at higher altitudes but it also provides their skin with some protection from the sun. The hairless parts of their bodies are light to dark brown in colour depending on the age of the individual (their skin darkens as they mature). They have large ears that give them excellent hearing and a heavy brow-ridge over their eyes. Like other great apes, Chimpanzees have good sight and are able to see in colour, while their forward facing eyes allow them to focus on a single object clearly. They have long fingers and an opposable big toe that helps them to grip onto things, with their arms also being longer than their legs which enables them to move around on all fours which is known as knuckle-walking. Chimpanzees have 32 teeth which are very similar to those of Humans to help them to not just grind up plant matter but their longer canines also help to bite into flesh.\n\nThe Chimpanzee is an omnivorous animal that eats hundreds of different types of food. The bulk of their diet is comprised of seasonal fruits, seeds and flowers that are picked from the trees, along with insects such as ants and termites that are extracted from their nests using a stick. However, they are known to eat larger prey too and when working together, sub-groups are able to kill monkeys and birds and have even been known to successfully hunt small antelope. Chimpanzees are the only animals (apart from Orang-Utans and Humans) that don't just use tools but also make them. They are known to strip the leaves and twigs off branches which are then inserted into a termite mound, where the termites crawl onto the branch and the Chimpanzee then licks them off. They are also known to use stones as hammers to open nuts and have even been known to use chewed leaves as a sponge to soak up water, which is then drunk from the leaf.\n\nChimpanzees are highly sociable and spend much time every day grooming one-another. Not only does this keep them clean and free from parasites but it is also thought to be relaxing for them and strengthens social bonds within the group. Chimpanzees are known to make 30 distinct calls with which they communicate with other members of the group, including the pant-hoot. This series of shrieks and roars is the most common noise for an adult Chimpanzee to make and can be heard up to 2km away. ",
      "family": "Hominidae",
      "height": "1m - 1.7m (3.25ft - 5.5ft)",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fchimpanzee_one?alt=media&token=07db2425-fb07-493c-a965-4c6a6e61f5c4",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fchimpanzee_two?alt=media&token=9f9b0742-a884-47c8-aed6-541082fd2cfc",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fchimpanzee_three?alt=media&token=b7601e3f-1cb6-456a-b9d3-9b543f7d91d2",

      "kingdom": "Animalia",
      "life_span": "50 - 60 years",
      "location": "Western and Central Africa",
      "name": "Chimpanzee",
      "no_of_species": "2",
      "other_name": "Common Chimpanzee",
      "scientific_name": "Pan troglodytes",
      "weight": "26kg - 70kg (57lbs - 154lbs)"
    },
    {
      "detail": "The humble chicken is thought to originate from the red jungle fowl and the grey jungle fowl, found in the rainforests of India. Today, the domestic chicken is thought to be more closely related to the grey jungle fowl due to the yellow coloring of its skin. Although they are similar, the Indian jungle fowl is about half the size of a domestic chicken today.\n\nThe chicken was thought to be domesticated more than 10,000 years ago where the Indians and later the Vietnamese bred chickens for meat, feathers and eggs. The domestication of chickens is thought to have then spread rapidly across Asia and into Europe and Africa resulting in the chicken being the most widely farmed animal today.\n\nThe male chicken is typically referred to as a cockerel but is known as a rooster in some countries such as Australia. A female chicken is called a hen and the little, fluffy yellow babies are called chicks. Chickens can live for up to 4 or 5 years in the wild but many commercially farmed chickens usually do not exceed the age of one. Many chickens have been known to live for longer and the oldest recorded chicken was said to live until it was 16 years old.\n\nChickens are omnivorous animals meaning that they eat a mixture of plant and animal matter. Although chickens are commonly seen scratching on the ground in search of seeds, berries and insects, chickens have also been known to eat larger animals such as lizards and even small mice.\n\nChickens are easy prey for numerous predators including foxes, cats, dogs, racoons, snakes and even large rats. Chicken eggs are also a very popular snack for many of these animals and are also stolen by other animals including larger birds and weasels.",
      "family": "Phasianidae",
      "height": "30cm - 45cm (11.8in - 17.7in)",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fchicken_one?alt=media&token=c1ebedfa-4de8-4ba4-a7ba-4b8868f57ca0",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fchicken_two?alt=media&token=80763e9b-7d19-45c3-84d9-c0939ba1283a",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fchicken_three?alt=media&token=a9316c42-f0f2-404e-85bc-47113ae32293",

      "kingdom": "Phasianidae",
      "life_span": "2 - 4 years",
      "location": "",
      "name": "Chicken",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Gallus Gallus",
      "weight": "1kg - 3kg (2.2lbs - 6.6lbs)"
    },
    {
      "detail": "The deer has proliferated across the globe and evolved many adaptations to help it cope with the rigors of a hostile world. Its regal antlers are some of the most notable characteristics in the animal kingdom, used for defense and sexual signaling. When it is disturbed, it can spring into action with its remarkable speed, agility, and finesse. And it has evolved a unique ability to digest all kinds of vegetation. The deer is a kind of evolutionary success story.\n\nMost deer species share in common a basic set of characteristics: two hooves on each foot, a four-chambered stomach, long and spindly legs, short tails, and a coat color that usually varies between brown, red, or gray. They also share a proclivity for the twilight hours. But the most prominent and conspicuous characteristic is the set of antlers on the head.\n\nThis large ornamentation reveals a clear delineation between the males and the females. All male deer possess antlers, while females lack them. Only in caribou (or reindeer) do the females grow antlers as well. The water deer is the lone aberration where neither gender grows antlers. Instead, both male and female members grow tusk-like canines instead of the elegant network of antlers. This appears to reflect an earlier pre-antler state of deer evolution.\n\nDeer are present on nearly all continents on earth, including large unbroken expanses of North America, South America, Europe, and Asia. Africa is an exception. It contains only a single species of native deer, the Barbary red deer. Australia has no native species, but several have been introduced into the wild. Deer thrive in deciduous forests, tropical rainforests, wetlands, and grasslands. A few species inhabit the cold tundra of the north, feeding on the sparse vegetation. The deer are most frequently found in the areas between forests and open plains. They are also capable of adapting to urban and suburban settings, which means that some species can thrive despite human encroachment.\n\nThe deer’s diet consists almost entirely of leaves, grass, lichen, buds, fruit, and herbs. The deer family is a type of ruminant — a mammal that has the capacity to break down and ferment plants with its four-chamber stomach. Each chamber contains various microbes to assist with this task. After the food is processed by the first stomach, the deer will then regurgitate it as cud and attempt to chew through the tough plant material. The food then proceeds through the remaining chambers of the stomach for digestion. However, unlike many other ruminants such as sheep and cattle, the deer palate is more selective. They prefer high-quality food that’s easier to digest. This is due to the large amounts of energy and nutrition needed to grow antlers.\n\nDeer are a critical food source for many predators in the wild, including bears, mountain lions, jaguars, tigers, lynx, coyotes, wolves, and large raptors. Birds and small mammals may feed on the carcass of a deceased deer. Individual deer, especially young fawns, are susceptible to predation. They aren’t completely defenseless against ferocious predators, but when given the choice, they will usually prefer to run. White-tailed deer have the ability to sprint up to 30 MPH. They can also leap immense distances up to 30 feet. If a nearby threat is spotted, deer may attempt to warn nearby members of the herd. The more solitary moose is protected by virtue of its size.",
      "family": "Cervidae",
      "height": "60cm - 105cm (24in - 206in)",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fdeer_one?alt=media&token=177183af-b37e-4a59-b920-7c8c643fae45",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fdeer_two?alt=media&token=c7ef822e-499a-464e-80b5-7425e6f9e4fc",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fdeer_three?alt=media&token=212406b4-1cc5-4c7b-9d48-f89c69c4ff5d",

      "kingdom": "Animalia",
      "life_span": "60cm - 105cm (24in - 206in)",
      "location": "",
      "name": "Deer",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Odocoileus virginiana",
      "weight": "10kg - 450kg (22lbs - 990lbs)"
    },
    {
      "detail": "Donkeys are members of the horse family, although donkeys and horses represent two very different species. After domestication in Egypt and North Africa, where they were used for meat and milk, donkeys evolved to become working beasts used to carry people or packages. They are slower than horses but are more surefooted. Historians believe that the domestication of donkeys increased the mobility of pastor cultures in the ancient world. Equipped with a social and calming nature, donkeys get along well with other domesticated mammals and can also be excellent companions for people with physical or mental disabilities.\n\nDonkeys come in many different sizes and colors. Wild species grow to about 49 inches from hoof to shoulder and weigh about 551 lbs. Domesticated donkeys come in different sizes, depending on how they are bred. They are typically 36 inches to 48 inches from hoof to shoulder, weighing from 400 to 500 lbs. The Sicilian donkey is the smallest, reaching only 24 inches while the ass of Mallorca is about 62 inches. The Mammoth Stock, the largest domestic breed, is 56 inches from hoof to shoulder and weighs about 950 lbs.\n\nDomesticated donkeys are found all over the world in many different cultures, but if given their preference, they are best adapted for warm, dry areas – particularly marginal desert areas. This adaptation has provided them with hardy immune and digestive systems. Wild donkeys are usually solitary and do not form harems, with each adult establishing a home range. One jack may dominate breeding over a wide area.\n\nDonkeys are herbivores, meaning they eat no meat. They enjoy a variety of foods, including hay, oats, grains, and grasses, but they will also eat shrubs and desert plants in certain areas. Their large lips allow donkeys to grab plants and pull them into their mouths where they rip it apart with large front teeth and grind it before swallowing. These voracious eaters can consume as much as 6,000 lbs of food each year. Donkeys’ immense appetites can become a problem if they become feral and take over the food supply from local creatures.",
      "family": "Equidae",
      "height": "90cm - 130cm (35in - 51in)",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fdonkey_one?alt=media&token=27d6d8e3-f93d-4c98-992d-9fda3203a873",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fdonkey_two?alt=media&token=fde37394-1403-4c6f-a694-5d0a6c65d97c",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fdonkey_three?alt=media&token=83210e3f-0a36-457a-90fe-c72eb570cf1e",

      "kingdom": "Animalia",
      "life_span": "15 - 30 years",
      "location": "",
      "name": "Donkey",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Equus Asinus",
      "weight": "200kg - 258kg (441lbs - 570lbs)"
    },
    {
      "detail": "Dogs are thought to have been first domesticated in East Asia thousands of years ago. People primarily used dogs for guarding the hunters and areas of land.\n\nToday’s domestic dog is actually a subspecies of the grey wolf, a type of dog that is feared by most humans. Many people today, in all countries around the world, keep dogs as household pets and many even regard their dog as a family member.\n\nThere are currently around 800 different species of domestic dog worldwide. Included are mountain dogs such as Saint Bernards or Huskies, and territorial guard dogs like the Neapolitan and Tibetan Mastiffs.",
      "family": "Canidae",
      "height": "",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fdog_one?alt=media&token=424accd0-2a84-4500-821b-44075ce24315",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fdog_two?alt=media&token=a9878d69-a834-4b8b-8cdd-4ecf705349e2",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fdog_three?alt=media&token=f25ab5ba-1441-40ce-8ea2-02a2c3567a5d",

      "kingdom": "Animalia",
      "life_span": "15 years",
      "location": "",
      "name": "Dog",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Canis lupus familiaris",
      "weight": "30kg (65lbs)"
    },
    {
      "detail": "The common dolphin is generally found around the Mediterranean Sea but are also commonly seen in deep off-shore waters and to a lesser extent over continental shelves that are preferred to shallower waters. Some populations of dolphin may be present all year round, others appear to move in a migratory pattern.\n\nCommon dolphins travel in groups of around 10-50 in number and frequently gather into schools numbering 100 to 2000 individuals. These schools are generally very active socially with groups often surfacing, jumping and splashing together. Typical dolphin behavior includes breaching, tail-slapping, chin-slapping, bow-riding and proposing.\n\nCommon dolphins are among the fastest swimming marine mammals, with some possibly reaching speeds of over 40 km/h. Dolphins have been known to use both their speed and large group sizes to develop different ways of hunting prey.",
      "family": "Delphinidae",
      "height": "20 - 45 years",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fdolphin_one?alt=media&token=4259aeac-bc14-4914-b9e2-1a11b76551cf",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fdolphin_two?alt=media&token=7032e280-79a1-4fd9-a1c0-f5288d355422",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fdolphin_three?alt=media&token=ad0feb1d-e7d4-4897-bf46-5580041ae5ba",

      "kingdom": "100kg - 300kg (220lbs - 660lbs)",
      "life_span": "",
      "location": "",
      "name": "Dolphin",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Delphinus Delphis",
      "weight": "2m - 4m (6.5ft - 13ft)"
    },
    {
      "detail": "The trunk-like nose of this seal makes it easy to see how it got its name. The average lifespan of a northern elephant seal is nine years while an elephant seal living in the Antarctic region can live from 20 to 22 years. Male seals can weigh up to 4.5 tons. They are carnivores living on a diet of squid, fish, rays, penguins, and some small species of sharks.\n\nThese seals are covered in a layer of light or dark tan or grayish fur. While male seals have a large trunk-like nose, also called a proboscis, female seals have a nose that’s normal in size. These seals have a large, round face, dark eyes, and whiskers.Its two short front flippers have nails on the ends that look like long, dark fingernails. Its back flippers are webbed, making this creature one of the most expert swimmers in the ocean.Male seals are much larger than females. A male northern elephant seal can weigh as much as 4,400 pounds and grow to over 13 feet in length. A female weighs around 1,300 pounds and grows to be about 10 feet long. Alternatively, a male southern elephant seal weighs around 11,000 pounds and grows to be about 16 feet in length! A female seal of this species weighs around 2,000 pounds and grows to be about 10 feet long.\n\nSquid, rays, penguins, small shark, crabs, and fish are all on the menu of these carnivores. During their nine months or so spent in the ocean, they are rarely seen at the surface of the water. They are either swimming just beneath the surface or diving into the depths in search of food. These seals add a lot of fat to their bodies during these months. Once mating season begins, they begin a fasting period (they don’t eat).\n\nGreat white sharks and killer whales are two predators of these seals. They are so large, they have very few predators in the ocean.",
      "family": "Phocidae",
      "height": "3m - 5m (10ft - 16ft)",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Felephant_seals_one?alt=media&token=e74342af-37a8-4099-a64f-39baa86f88a2",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Felectric_eel_two?alt=media&token=4f68b6ba-e75f-4fe2-bea7-09e31287299d",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Felectric_eel_three?alt=media&token=7ed7c5cd-d753-4f8c-832b-5a5d0721fa80",

      "kingdom": "Animalia",
      "life_span": "18 - 22 years",
      "location": "",
      "name": "Elephant Seal",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Mirounga",
      "weight": "900kg - 3,000kg (2,000lbs - 6,000lbs)"
    },
    {
      "detail": "Electric Eels are found in the waters of South America, and are capable of generating a 500volt electric shock through 28ft of still water. The shock that the electric eel produces is enough to harm any large mammal, including humans.\n\nElectric eels can grow up to 2.5 metres and only need to surface for air every 10 minutes due to the eels complex circulatory system. Electric eels tend to live in muddy beds in calm water, eating fish and small mammals.\n\nThe electricity that the electric eel uses to shock its prey, is produced in pairs of organs that are found in the abdomen of the electric eel. These electricity producing organs take up around of 80% of the body of the electric eel leaving only 20% of the electric eels body free to hold the electric eels vital organs that it needs to survive.\n\nElectric eels are found inhabiting fresh waters of the Amazon and Orinoco river basins in South America, and the electric eels tend to prefer the river floodplains, swamps, coastal plains, and creeks. Electric eels tend to live on muddy bottoms in calm water and in stagnant arms of rivers, where the electric eel spends most of its time hunting.\n\nThe electric eel is also known for its unusual breeding behaviour. In the dry season, a male electric eel makes a nest from his saliva into which the female electric eel lays her eggs. As many as 17,000 young electric eels will hatch from the eggs in one nest. These young electric eels feed mainly on invertebrates found on the river bed, however, first-born baby electric eels have been known to gobble up the eggs from batches of other electric eels that were laid only a short time after themselves.",
      "family": "Gymnotidae",
      "height": "2.5m (8.22ft)",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Felectric_eel_one?alt=media&token=aceba9af-1977-44e1-b700-30ce26297d91",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Felectric_eel_two?alt=media&token=4f68b6ba-e75f-4fe2-bea7-09e31287299d",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Felectric_eel_three?alt=media&token=7ed7c5cd-d753-4f8c-832b-5a5d0721fa80",

      "kingdom": "Animalia",
      "life_span": "15 - 22 years",
      "location": "",
      "name": "Electric Eel",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Electrophorus Electricus",
      "weight": "20kg (44lbs)"
    },
    {
      "detail": "There are numerous subspecies of the Asian elephant, these are the Indian Elephant, Sri Lankan Elephant, Sumatran, Borneo Elephant.\n\nAfrican elephants are larger than Asian elephants and have two subspecies which are the African Bush Elephant and African Forest Elephant.\n\nThe elephant is the only known mammal that, despite having knee joints, cannot jump! This is thought to be primarily due to the elephant’s sheer size but also because of the way that the elephant’s legs are built, they are short and stocky to support the elephant’s phenomenal weight.\n\nElephants are herbivores that spend around 22 hours eating! The elephant searches for green leaves in the tree tops but it is not uncommon for the elephant to tear down the tree to get the leaves.One old elephant related myth is that elephants are afraid of mice. There are a number of theories from where this arose such as the size difference (elephants are one of the biggest land animals, mice are one of the smallest), the fear from the elephant that a mouse could crawl into the elephants trunk and nest, and the fact that mice have been known to crawl over elephants while they are sleeping so they can get to any left over food, are also viable possibilities. Whether or not elephants are actually scared of mice is unknown, however tests show that elephants are definitely not as comfortable with mice around as you might expect.",
      "family": "Elephantidae",
      "height": "2m - 3.6m (7ft - 12ft)",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Felephant_one?alt=media&token=a7de7be0-7eb2-46c3-9684-b957021c097d",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Felephant_two?alt=media&token=75e869e1-e485-4bc2-87c6-ed3f400522b4",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Felephant_three?alt=media&token=f429c770-5c5f-49b5-b773-65c6ff5f1871",

      "kingdom": "Animalia",
      "life_span": "55 - 70 years",
      "location": "",
      "name": "Elephant",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Loxodonta Africana",
      "weight": "3,000kg - 5,400kg (6,500lbs - 12,000lbs)"
    },
    {
      "detail": "Falcons are medium sized birds of prey found all across the world although falcons tend to prefer the more temperate regions of the Northern Hemisphere. Falcons are best known for their ruthlessness and their incredible flying abilities.Falcons have tapered wings that allow the falcon to change direction extremely quickly especially when compared to other birds. Falcons have been recorded diving at speeds of up to 200mph, meaning they are the fastest creatures on the planet!\n\nThere are more than 40 different species of falcon that can be found all around the world such as the peregrine falcon and the black falcon. Falcons vary in size from 25cm tall to more than 60cm tall, but the height of the falcon depends on the species. The peregrine falcon is the most common bird of prey in the world and is found on every continent besides Antarctica.\n\nFalcons are birds of prey and are therefore known for their incredible hunting skills and being a ruthless, dominant predator within their environment. Falcons hunt their prey from the skies above and swoop down through the air to catch it once they have spotted a meal with their incredible eyesight. Falcons hunt all kinds of small animals like mice, frogs, fish and falcons will even catch small birds in the air.Due to the large size, speed and alertness of the falcon, the falcon has few natural predators and even fewer that are actually airborne. Humans and wolves tend to be the main predators of the falcon on the ground and eagles and even large owls have been known to hunt the smaller species of falcon (and of course the young and inexperienced falcons) in the air. The eggs and chicks of the falcon are particularly vulnerable to being eaten.\n\nFalcons have adapted in many ways to maximise their chances of survival in the skies. The falcon has tapered wings that allow the falcon to be more agile; incredibly acute eyesight which enables the falcon to spot prey on the ground far below; an aerodynamic body shape means that the falcon glides through the air more easily and a sharp pointed beak helps the falcon to grab and eat it’s prey more effectively.",
      "family": "Falconidae",
      "height": "22cm - 40cm (9in - 19in)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Ffalcon_one?alt=media&token=fb67df50-2c7c-485b-8544-58dce032840c",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Ffalcon_two?alt=media&token=22cd543a-3cc7-41ea-ab34-5e0fd6bcf353",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Ffalcon_three?alt=media&token=035bfce7-a43f-4857-b573-efa9b1023b60",

      "kingdom": "Animalia",
      "life_span": "12 - 18 years",
      "location": "",
      "name": "Falcon",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Falconiforme",
      "weight": "0.7kg - 1.2kg (1.5lbs - 2.6lbs)"
    },
    {
      "detail": "The fox is a scavenger carnivores dog, generally found in urban city areas in the northern Hemisphere. The fox is a nocturnal mammal, meaning that the fox only goes out a night to hunt for prey.\n\nWild foxes tend live for around 6-7 years, but some foxes have been known to be older than 13 in captivity. The wild fox hunts for the mouse and other small mammals and birds, but foxes appear to enjoy all species of insect.A fox is generally smaller than other members of the dog family like wolves, jackals and domestic dogs. Foxes can be a pest in the cities as foxes are often seen tearing into rubbish.\n\nThere are around 12 different species of fox found around the world, which include the urban fox or red fox, the beautifully white Arctic fox, the sand fox which is a light-coloured fox found in desert regions and the tiny yet big eared fennec fox.\n\nFoxes in Europe have been the victims of fox hunting, an extremely controversial sport that involves humans on horses hunting out the fox, lead by a pack of hound dogs which would find the fox by following the scent of the fox. Fox hunting in this manner is now illegal, although it is still allowed if the sport only contains humans on horseback, without the use of their clever but somewhat vicious dogs.\n\nThe fox is also found in the more rural areas of the Northern hemisphere, although fox numbers in the countryside are outnumbered by fox numbers in cities as due to the foxes scavenging nature, food is more readily available in the urban streets.",
      "family": "Canidae",
      "height": "40cm - 83cm (16in - 33in)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Ffox_one?alt=media&token=0887ca95-9b2b-49c8-b84e-ce09f753e053",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Ffox_two?alt=media&token=7d9d07f4-16ff-47e1-a909-8252b4ea602e",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Ffox_three?alt=media&token=9d11c213-e446-4a03-ba00-769cd03f3710",
      "kingdom": "Animalia",
      "life_span": "3 - 11 years",
      "location": "",
      "name": "Fox",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Vulpes vulpes",
      "weight": "5kg - 11kg (11lbs - 24lbs)"
    },
    {
      "detail": "The Giraffe is a long-necked, hoofed mammal that is natively found grazing in the open woodlands of sub-Saharan Africa. The Giraffe is the tallest living animal on land and despite its height is mostly closely related to the much smaller and solitary Okapi, that is found elusively dwelling in the dense tropical forests. There are nine recognised sub-species of Giraffe that are found in differing geographic locations and vary somewhat in the colour and pattern of their spot-like markings. Although the Giraffe would have once been found across sub-Saharan Africa and even in parts of North Africa, today they are extinct from much of their historically vast natural range with only small, isolated populations remaining in a handful of regions in central Africa. Further south however, Giraffe populations are considered to be stable and are even growing in some areas due to an increase in demand for them on private ranches.\n\nThe Giraffe has an enormously long neck which allows it to exploit the leaves and vegetation that are too high up for other animals to find. Despite their length, the neck of the Giraffe actually contains the same number of bones as numerous other hoofed mammals but they are simply longer in shape. The Giraffe’s elongated neck leads into a short body, with long and thin, straight legs and a long tail that is tipped with a black tuft that helps to keep flies away. The Giraffe tends to be white in colour with brown or reddish markings that cover its body (with the exception of their white lower legs). The markings of each Giraffe are not only unique to that individual but they also vary greatly between the different Giraffe species in size, colour and the amount of white that surrounds them. All Giraffes though have large eyes that along with their height give them excellent vision, and small horn-like ossicones on the top of their heads.\n\nThe large size of the Giraffe means that it must spend a great deal of time eating which it tends to do the most during the more tolerable heat of the morning and evening. During the hot midday sun, Giraffes rest in more shaded regions where they (like a number of their relatives) regurgitate their food known as cud, before then consuming it again. Small herds comprised of a number of females and their young spend both the day and night together to protect their offspring from predators, but male Giraffes are much more solitary often roaming over large areas in search of a fertile female. If however they come into contact with a rival male, the two will begin to bump heads and interlock their necks as a way of establishing a dominance hierarchy, with the winner earning the right to mate with the local females.\n\nThe Giraffe is a herbivorous animal that has evolved to be the height that it is so that it has less competition for food on the higher branches of the canopy. Giraffes are known to eat up to 60 different species of plant throughout the year and do so by grabbing onto branches with their long, black tongue (that can grow up to 18 inches long) and using their tough prehensile lips and flattened, grooved teeth are able to strip the leaves off the branches. Giraffes most commonly eat from acacia trees but also browse for wild apricots, flowers, fruits and buds along with eating seeds and fresh grass just after the rains. Giraffes get 70% of their moisture from their food so need to drink very little but when they do come across clean water, they must splay their front legs (which are longer than the back) in order to get their head close enough to the ground to drink.",
      "family": "Giraffidae",
      "height": "4m - 6m (13ft - 20ft)",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fgiraffe_one?alt=media&token=39cab3f0-7e2d-49c7-b4c0-8dbca9dbea41",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fgiraffe_two?alt=media&token=942ac062-b5b0-4d6e-b9ab-69497c9bb4b6",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fgiraffe_three?alt=media&token=d0b73f62-159b-4d64-99e5-7f1029b91768",

      "kingdom": "Animalia",
      "life_span": "20 - 25 years",
      "location": "sub-Saharan Africa",
      "name": "Giraffe",
      "no_of_species": "9",
      "other_name": "",
      "scientific_name": "Giraffa camelopardalis",
      "weight": "550kg - 1,930kg (1,200lbs - 4,200lbs)"
    },
    {
      "detail": "Goats originated from the mountainous areas of west Asia and eastern Europe, grazing on hillsides and plains. Modern day common goats are known as domesticated goats and are thought to be very closely related to a sheep.\n\nFor thousands of years goats have been used for their meat, hair, milk and skins. In some countries goats are also used to help with carrying heavy loads.\n\nOne of the rarer species of goat is the fainting goat from Tennessee in the United States. These goats literally freeze up, the goats legs go rigid and the goat falls over. The goat will soon get back up and continue grazing until it happens again.\n\nMost species of male goats naturally have two horns on the top of their head. The horns of the goat are made out of the substance keratin, from which human fingernails are also made. The male goats mainly use their horns to defend themselves from other dominant male goats and from unwanted predators. Some species of goat also have females that have two horns on the tops of their heads.\n\nGoats are typically found in more barren landscapes and many species of goat tend to prefer mountainous and rocky terrains. The goats that inhabit the mountainous cliff faces are amazingly agile and are able to hold their hold well on small ledges and are very adept at jumping and running around on them.\n\nThe goat is natural prey to many predators which include leopards, tigers, large reptiles and most commonly humans. Today the goat is also found in parts of South America where the goats are farmed and hunted for their meat and skins.",
      "family": "Bovidae",
      "height": "",

      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fgoat_one?alt=media&token=1455b1f0-bdf3-4158-bb8e-9f4237f49856",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fgoat_two?alt=media&token=4309e8fa-291e-44bb-9a53-a89c80651082",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fgoat_three?alt=media&token=db9e55b3-d104-4394-8e7e-c09f4b949432",

      "kingdom": "Animalia",
      "life_span": "10-15 years",
      "location": "",
      "name": "Goat",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Capra Aegagrus Hircus",
      "weight": "54-77kg (120-170lbs)"
    },
    {
      "detail": "Gorillas are the biggest of the world’s primates and live in the forests in select parts of Africa. The gorilla population is sadly much lower than it used to be meaning that gorillas are an endangered species.\n\nGorillas are herbivores, eating vegetation, fruits, shoots, berries and leaves. An adult male gorilla is able to consume up to 27 kg of food every day. Gorillas are thought to be the most closely related to chimps and humans. It is said that the DNA of gorillas is 98-99% identical to human DNA!\n\nThe gorilla is a very sociable animal inhabiting the African wilderness if groups from around 5 to 30 gorillas. The gorilla spends most of its time eating, sleeping and grooming the other gorillas. Gorillas move about by walking on their knuckles which helps to support the gorilla’s weight\n\nThe gorilla is considered to be a highly intelligent animal on a similar level with humans and dolphins. The real extent of the gorilla’s intelligence is unknown, however one gorilla bred in captivity was successfully trained in human sign language.The senses of a gorilla are very similar to the senses of the human and include hearing, taste, touch, smell and sight, although the sight of the gorilla is not quite as acute as the sight of the human but the gorilla is thought to be able to see in colour vision.\n\nThe gorilla spends the night sleeping in a nest which the gorilla makes out of leaves and other plant materials. The nest of the gorilla is shaped like a bowl and is where the mother gorilla will sleep with the baby gorillas.\n\nDespite what many people think, the gorilla is not an aggressive animal as the gorilla is known to be shy and peaceful in nature. The gorilla will generally only display aggressive behaviour towards another animal if the gorilla feels under threat but the gorilla will only tend to make lots of noise rather than attacking an unwanted intruder.",
      "family": "Hominidae",
      "height": "",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fgorilla_one?alt=media&token=c0940592-fbc7-4982-893c-18dd76274f06",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fgorilla_two?alt=media&token=e1c2253e-a50b-4850-b8e6-ca4ea6cfcd69",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fgorilla_three?alt=media&token=c735d609-0324-4f5f-9164-833dc6ca4904",
      "kingdom": "Animalia",
      "life_span": "35-50 years",
      "location": "",
      "name": "Gorilla",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Troglodytes Gorilla",
      "weight": "100-200kg (220-440lbs)"
    },
    {
      "detail": "Hammerhead Sharks are appropriately named after their flat shaped heads. Hammerhead sharks are large carnivorous fish that prey on large fish and occasionally hammerhead sharks will hunt small water mammals.\n\nHammerhead sharks are found in the warmer waters of oceans worldwide but hammerhead sharks are particularly found in coastal waters, and along continental shelves. The shallow waters that the hammerhead sharks inhabit allow the hammerhead shark to hunt prey more easily.\n\nThere are 9 different species of hammerhead shark worldwide, ranging from 3ft to 20ft in length! Hammerhead sharks are not commonly known to attack humans but can be aggressive if a human came into contact with a hammerhead shark.The flat shaped head of the hammerhead shark is thought to allow the hammerhead shark to detect prey more easily, as it increases the hammerhead sharks sensitivity to sonar activity. Hammerhead sharks are thought to use sonar waves detection in a similar way to their five main senses, so it’s like the hammerhead shark has a sixth sense.\n\nThe shape of the head of the hammerhead shark is made up of two projections on either side of the face of the hammerhead shark, which gives the hammerhead shark the head shape that resembles a hammer almost rectangular in shape. The eyes and nostrils of the hammerhead shark are found at the ends of the hammer allowing the hammerhead shark to have better vision and smell of the surrounding water.\n\nLike many other species of shark the hammerhead shark is a solitary hunter during the night, but during the daytime hammerhead sharks are known to form schools of up to 100 hammerhead shark individuals. Hammerhead sharks are commonly seen in larger groups during the summer months when the hammerhead sharks are migrating together in search of cooler waters.",
      "family": "Sphyrnidae",
      "height": "",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fhammerhead_shark_one?alt=media&token=72c29240-2c93-4c52-a517-4b6ac059ff85",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fhammerhead_shark_two?alt=media&token=f0d41c2d-ee8b-4fb4-a647-e78937caf928",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fhammerhead_shark_three?alt=media&token=94e86ba5-e361-4294-a814-f89aaa2cc12f",

      "kingdom": "Animalia",
      "life_span": "20-25 years",
      "location": "",
      "name": "Hammerhead Shark",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Hammerhead Shark",
      "weight": "230-450kg (500-1000lbs)"
    },
    {
      "detail": "The hedgehog is a small mammal that is predominantly found in Europe, Asia and Africa and the hedgehog has also been artificially introduced to New Zealand.The hedgehog is commonly around 25 cm long, with the hedgehogs back being covered in spikes. The hedgehog can also protect itself by curling its body into a ball so only the hedgehog spikes are exposed. This method of only exposing the spikes of the hedgehog, keeps the hedgehog safe from predators.\n\nThere are thought to be 16 different species of hedgehog found around the world although, oddly enough, there are no species of hedgehog that are native to Australia and no living species of hedgehog that are native to North America.The spikes of the hedgehog are hollow hairs that are made from the protein keratin (the same stuff that human hair and fingernails are made from), and unlike the spikes of the porcupine, the spikes of the hedgehog cannot be removed easily. The spikes of the hedgehog also differ from the spikes of the porcupine as the hedgehog spikes are not poisonous or barbed.When baby hedgehogs get to a certain age, the young hedgehog will shed the softer baby spikes that are then replaced with the stronger and darker spikes of the adult hedgehog. Hedgehogs have also been known to shed a number of spikes when the hedgehog is under extreme stress or if the hedgehog is poorly.\n\nAll species of hedgehog have evolved to react to their natural surroundings slightly differently. Despite the fact that hedgehog species all commonly roll themselves into a tight ball to expose only their outward pointing spikes, some hedgehog species, such as those hedgehogs inhabiting the desert regions, will often try to run away from predators first leaving their spiky ball defense as a later option. This has led to hedgehogs in different environments to have different predators. For example, the larger forest hedgehogs are more commonly preyed upon by owls, birds and ferrets, where the smaller hedgehogs that exist in more open areas are hunted by foxes, wolves and weasels.\n\nMost hedgehog species are loudly vocal animals and use grunts and snuffles in order to communicate between one another. Some species of hedgehog will also communicate between each other using louder squealing noises.\n\nThe larger species of hedgehog give birth to around 3 or 4 baby hedgehogs, but the smaller hedgehog species tend to have slightly larger litters and therefore give birth to 5 to 7 babies. When the hedgehog babies are first born, they are born blind and without their spikes. Although the spikes of the hedgehog babies can been vaguely seen under the skin, the spikes of the baby hedgehog will grow through the skin in a matter of days after the baby hedgehog has been given a thorough clean by the mother hedgehog.",
      "family": "Erinaceidae",
      "height": "",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fhedgehog_one?alt=media&token=4ff6770f-55b7-42e4-8c4b-a09a22f7b80e",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fhedgehog_two?alt=media&token=dc92549c-bf83-47b1-8478-e2dffd3f831c",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fhedgehog_three?alt=media&token=ced88e7e-533c-4473-baf0-a51b19f402ce",
      "kingdom": "Animalia",
      "life_span": "3-6 years",
      "location": "",
      "name": "Hedgehog",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Atelerix Albiventris",
      "weight": "1-2kg (2.2-4.4lbs)"
    },
    {
      "detail": "Horses evolved over 50 million years from small many toed animals to the big beautiful, single-toed horses of today. The modern horse has been domesticated around the world for many reasons including transportation and battle.Horses tend to live for about 30 years, and the oldest recorded horse at age 56 died in 2007. Horses graze on plant matter and vegetation, preferably tender green grass. The height of a horse is measured in hands, 1 hand being the same as 10cm (4 inches). The age of the horse is estimated by the pattern of tooth wear in his mouth.\n\nAn adult female is called a mare, and a young female is called a filly. An adult male is a stallion, and a young male is a colt. An unweaned baby of either sex is a foal. Castrated males and spayed females are called geldings. Mares carry their young inside them for approximately 11 months. When the baby horse is born, the young horse is often able to stand and then run about not long after birth. A mare comes into season one month after her foal is born. If she is remated then, she will have a foal at the same time each year.\n\nThere are thought to be more than 300 different breeds of horse found around the world today, each being bred for a purpose. Enormous draft horses such as Clydesdales pull heavy wagons, lighter saddle horses are for riding, and pony breeds are suitable for children and small adults.\n\nHorses have remarkable hearing and are almost able to have 360 degree hearing. The sense of smell of the horse is better than that of a human but the horse tends to rely more on vision than smell. Their field of monocular vision is almost 360 degrees with a narrower field of binocular vision in front and slightly to the sides. Horses have a blind spot directly in front of the nose and directly behind them. For this reason it is better to approach from the side. Whether they can see color is inconclusive. They do have much better night vision than humans.\n\nHorses have an advanced sense of taste which allows the horse to sort through grasses and grains to find the things that the horse would most like to eat. Horses generally will not eat plants that are poisonous, but when the horse cannot find more adequate food, the horse will eat plants that contain toxins. A horse’s gut is designed to have food flowing through it almost continually, and horses graze most of the day if allowed.",
      "family": "Equidae",
      "height": "25-30 years",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fhorse_one?alt=media&token=0b4e8037-4251-4b0f-bfac-a36df933eaa2",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fhorse_two?alt=media&token=05180d84-4c16-4059-9d4f-f8e8ba31d6e3",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fhorse_three?alt=media&token=c778dffd-e7e5-4636-a26b-069a1368aec4",

      "kingdom": "Animalia",
      "life_span": "",
      "location": "",
      "name": "Horse",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Equus Caballus",
      "weight": "380-550kg (840-1,200lbs)"
    },
    {
      "detail": "Impala live in the light woodlands and savanna of southern and eastern Africa. These medium-sized antelopes travel and gather in herds of hundreds during the rainy season. The rains bring a bounty of grasses, shoots, herbs, bushes and shrubs for their grazing. In the dry season, these herds work together to find food in a process called “browsing,” as part of which they eat leaves, twigs and higher-growing vegetation.\n\nImpala have mostly red-brown fur that helps them hide among brush. But they feature white on their bellies, chins, lips, inner ears, eyebrows and tails. The tail and backside of the animal also feature a set of black stripes that form the letter “M.” Otherwise, they have more black across their foreheads, thighs and ear tips.Female impala, called ewes, have no horns. But males, the rams, grow curved horns with a notable twisted appearance due to ridges. These horns are black and grow as long as 36 inches.Males measure between 30 and 36 inches tall from their hooves to their shoulders. Females grow to a smaller span of 28 to 33 inches. Their length from their head to the base of their tail is between 47 and 63 inches, for both genders. An impala tail adds between 12 and 18 inches more to their length. Weight is usually 88 to 99 pounds for females and 132 to 143 pounds for males.\n\nImpala prove highly adaptable herbivores. They change their diet according to what vegetation is available around them. They prefer to eat fresh grass. But they will then rely on many types of foliage, including herbs and shoots, when there is no grass. Other foods they eat include shrubs, bushes, fruits and acacia pods.\n\nThe primary predators of impala include stalking animals of lions, leopards, cheetahs, hyenas and wild dogs. But many also lose their lives to jackals, humans, eagles, hunting dogs and caracal. When the animal attempts to drink water from a river or they fail to pay attention, an impala can become a meal for a hungry Nile crocodile.",
      "family": "Aepyceros Melampus",
      "height": "",
      "imageName1": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fimpala_one?alt=media&token=90b51943-3845-4351-a6bc-125450030faa",
      "imageName2": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fimpala_two?alt=media&token=9c4bd600-6644-49c6-b6a2-857b9c0e8cf3",
      "imageName3": "https://firebasestorage.googleapis.com/v0/b/kamasutra-959cf.appspot.com/o/Animals%20Images%2Fimpala_three?alt=media&token=e823d36f-c2ca-48d2-acd2-55077f2e49f7",
      "kingdom": "Animalia",
      "life_span": "12-15 years",
      "location": "",
      "name": "Impala",
      "no_of_species": "",
      "other_name": "",
      "scientific_name": "Aepyceros Melampus",
      "weight": "37-75kg (81.6-165lbs)"
    }
  ]

